[
    {
        "id": "mexico",
        "nombre": "México",
        "sinonimos": ["la república mexicana", "méjico", "estados unidos mexicanos"],
        "latitud": 19.4326,
        "longitud": -99.1332,
        "bandera": "🇲🇽",
        "descripcionGeneral": "Es un país vibrante de América del Norte, puente entre culturas y conocido por su biodiversidad.",
        "cultura": "Famoso por el Día de Muertos, el mariachi y una gastronomía que es Patrimonio de la Humanidad.",
        "datosCuriosos": ["La Ciudad de México se hunde unos 10 cm al año.", "El chocolate fue inventado aquí."],
        "continent": "América",
        "population": 126014024
    },
    {
        "id": "canada",
        "nombre": "Canadá",
        "sinonimos": ["el gran norte blanco"],
        "latitud": 45.4215,
        "longitud": -75.6972,
        "bandera": "🇨🇦",
        "descripcionGeneral": "El segundo país más grande del mundo, famoso por su naturaleza salvaje, montañas rocosas y auroras boreales.",
        "cultura": "Conocido por su amabilidad, el hockey sobre hielo y ser el mayor productor de jarabe de arce.",
        "datosCuriosos": ["Tiene más lagos que el resto del mundo combinado.", "La palabra 'Canadá' significa 'pueblo'."],
        "continent": "América",
        "population": 38005238
    },
    {
        "id": "estados_unidos",
        "nombre": "Estados Unidos",
        "sinonimos": ["usa", "eeuu", "estados unidos de américa", "gringolandia"],
        "latitud": 38.9072,
        "longitud": -77.0369,
        "bandera": "🇺🇸",
        "descripcionGeneral": "Potencia mundial ubicada en Norteamérica, conocida por su influencia cultural, tecnológica y ciudades icónicas.",
        "cultura": "Un crisol de culturas, cuna de Hollywood, el Jazz, el Rock and Roll y la innovación de Silicon Valley.",
        "datosCuriosos": ["La bandera actual fue diseñada por un estudiante de 17 años.", "No tienen idioma oficial a nivel federal."],
        "continent": "América",
        "population": 331449281
    },
    {
        "id": "guatemala",
        "nombre": "Guatemala",
        "sinonimos": ["tierra de la eterna primavera"],
        "latitud": 14.6349,
        "longitud": -90.5069,
        "bandera": "🇬🇹",
        "descripcionGeneral": "El corazón del mundo maya en Centroamérica, lleno de volcanes activos, lagos y selvas tropicales.",
        "cultura": "Hogar de la antigua ciudad de Tikal y tradiciones textiles coloridas que siguen vivas hoy.",
        "datosCuriosos": ["Inventaron el chocolate instantáneo (los mayas).", "Su moneda es el Quetzal, llamada así por su ave nacional."],
        "continent": "América",
        "population": 16858333
    },
    {
        "id": "belice",
        "nombre": "Belice",
        "sinonimos": ["belize"],
        "latitud": 17.1899,
        "longitud": -88.4976,
        "bandera": "🇧🇿",
        "descripcionGeneral": "Pequeño país caribeño en la costa de Centroamérica, famoso por su inmenso arrecife de coral.",
        "cultura": "El único país de Centroamérica donde el idioma oficial es el inglés, con fuerte influencia caribeña.",
        "datosCuriosos": ["Tiene el Gran Agujero Azul, un sumidero submarino visible desde el espacio.", "Fue la capital de los piratas."],
        "continent": "América",
        "population": 397628
    },
    {
        "id": "el_salvador",
        "nombre": "El Salvador",
        "sinonimos": ["el pulgarcito de américa"],
        "latitud": 13.6929,
        "longitud": -89.2182,
        "bandera": "🇸🇻",
        "descripcionGeneral": "El país más pequeño y densamente poblado de Centroamérica, conocido como tierra de volcanes.",
        "cultura": "Famoso por las pupusas (su plato nacional) y sus excelentes playas para el surf.",
        "datosCuriosos": ["Es conocido como la Tierra de los Volcanes.", "Fue el primer país en adoptar Bitcoin como moneda legal."],
        "continent": "América",
        "population": 6486201
    },
    {
        "id": "honduras",
        "nombre": "Honduras",
        "sinonimos": ["catrachos"],
        "latitud": 14.0723,
        "longitud": -87.1921,
        "bandera": "🇭🇳",
        "descripcionGeneral": "País montañoso con acceso al Caribe y al Pacífico, hogar de las famosas ruinas mayas de Copán.",
        "cultura": "Famoso por la cultura Garífuna y sus arrecifes en las Islas de la Bahía, ideales para bucear.",
        "datosCuriosos": ["Ocurre una 'lluvia de peces' en Yoro cada año.", "Fue el primer lugar donde Colón pisó tierra firme en América."],
        "continent": "América",
        "population": 9904607
    },
    {
        "id": "nicaragua",
        "nombre": "Nicaragua",
        "sinonimos": ["tierra de lagos y volcanes"],
        "latitud": 12.1150,
        "longitud": -86.2362,
        "bandera": "🇳🇮",
        "descripcionGeneral": "El país más grande de Centroamérica, conocido por su enorme lago de agua dulce y volcanes activos.",
        "cultura": "Tierra de poetas como Rubén Darío y ciudades coloniales coloridas como Granada y León.",
        "datosCuriosos": ["El lago de Nicaragua tiene los únicos tiburones de agua dulce del mundo.", "Sus calles no tienen nombres oficiales."],
        "continent": "América",
        "population": 6624554
    },
    {
        "id": "costa_rica",
        "nombre": "Costa Rica",
        "sinonimos": ["ticos", "pura vida"],
        "latitud": 9.9281,
        "longitud": -84.0907,
        "bandera": "🇨🇷",
        "descripcionGeneral": "Paraíso ecológico mundialmente conocido por su biodiversidad, selvas y filosofía de Pura Vida.",
        "cultura": "Un país pacifista sin ejército desde 1948, enfocado en la educación y la naturaleza.",
        "datosCuriosos": ["Contiene el 5% de la biodiversidad mundial.", "Es uno de los países más felices del mundo."],
        "continent": "América",
        "population": 5094118
    },
    {
        "id": "panama",
        "nombre": "Panamá",
        "sinonimos": ["puente del mundo"],
        "latitud": 8.9824,
        "longitud": -79.5199,
        "bandera": "🇵🇦",
        "descripcionGeneral": "El puente que une las Américas, famoso por su canal interoceánico y rascacielos modernos.",
        "cultura": "Una mezcla vibrante de culturas globales, comercio, selvas tropicales y comunidades indígenas.",
        "datosCuriosos": ["Es el único lugar donde puedes ver el amanecer en el Atlántico y el atardecer en el Pacífico.", "El sombrero Panamá es de Ecuador."],
        "continent": "América",
        "population": 4314767
    },
    {
            "id": "cuba",
            "nombre": "Cuba",
            "sinonimos": ["la isla", "la perla del caribe"],
            "latitud": 21.5218,
            "longitud": -77.7812,
            "bandera": "🇨🇺",
            "descripcionGeneral": "La isla más grande del Caribe, famosa por su arquitectura colonial, playas vírgenes y autos clásicos.",
            "cultura": "Mundialmente reconocida por su música (Salsa, Son, Bolero), el tabaco premium y el béisbol.",
            "datosCuriosos": ["Tiene una de las tasas de alfabetización más altas del mundo.", "El pájaro más pequeño del mundo, el zunzuncito, vive aquí."],
            "continent": "América",
            "population": 11326616
        },
        {
            "id": "republica_dominicana",
            "nombre": "República Dominicana",
            "sinonimos": ["quisqueya", "rd"],
            "latitud": 18.7357,
            "longitud": -70.1627,
            "bandera": "🇩🇴",
            "descripcionGeneral": "Comparte la isla de La Española, famosa por sus resorts de lujo, playas de arena blanca y picos montañosos.",
            "cultura": "Cuna del Merengue y la Bachata. El béisbol es el deporte nacional y una pasión absoluta.",
            "datosCuriosos": ["Santo Domingo es la ciudad europea más antigua de las Américas.", "Es el único país con una Biblia abierta en su escudo."],
            "continent": "América",
            "population": 10847910
        },
        {
            "id": "haiti",
            "nombre": "Haití",
            "sinonimos": ["la perla de las antillas"],
            "latitud": 18.9712,
            "longitud": -72.2852,
            "bandera": "🇭🇹",
            "descripcionGeneral": "Comparte la isla con Dominicana, posee una historia revolucionaria única y fortalezas impresionantes.",
            "cultura": "Famosa por su arte vibrante, el idioma Kreyòl y su historia de independencia.",
            "datosCuriosos": ["Fue la primera república negra independiente del mundo.", "Posee la fortaleza más grande de América: la Citadelle Laferrière."],
            "continent": "América",
            "population": 11402528
        },
        {
            "id": "jamaica",
            "nombre": "Jamaica",
            "sinonimos": ["tierra de madera y agua"],
            "latitud": 18.1096,
            "longitud": -77.2975,
            "bandera": "🇯🇲",
            "descripcionGeneral": "Isla famosa por su influencia cultural global, sus Montañas Azules y un estilo de vida relajado.",
            "cultura": "Lugar de nacimiento del Reggae y Bob Marley. Tierra de los velocistas más rápidos del mundo.",
            "datosCuriosos": ["Es el país con más iglesias por kilómetro cuadrado.", "La bandera jamaiquina es la única en el mundo que no tiene rojo, blanco o azul."],
            "continent": "América",
            "population": 2961167
        },
        {
            "id": "puerto_rico",
            "nombre": "Puerto Rico",
            "sinonimos": ["borinquen", "la isla del encanto"],
            "latitud": 18.2208,
            "longitud": -66.5901,
            "bandera": "🇵🇷",
            "descripcionGeneral": "Territorio caribeño con una identidad hispana vibrante, selvas tropicales y ciudades amuralladas.",
            "cultura": "Potencia mundial de la música urbana (Reggaetón, Salsa) y gastronomía criolla.",
            "datosCuriosos": ["Tiene el único bosque tropical lluvioso en el sistema de parques de EE.UU. (El Yunque).", "Inventaron la piña colada."],
            "continent": "América",
            "population": 3193694
        },
        {
            "id": "bahamas",
            "nombre": "Bahamas",
            "sinonimos": ["las bahamas"],
            "latitud": 25.0343,
            "longitud": -77.3963,
            "bandera": "🇧🇸",
            "descripcionGeneral": "Archipiélago de más de 700 islas con las aguas más claras y turquesas del planeta.",
            "cultura": "Famosa por el festival Junkanoo y los curiosos cerdos nadadores de Exuma.",
            "datosCuriosos": ["Tiene el agujero azul más profundo del mundo.", "Alguna vez fue el refugio favorito de piratas famosos como Barbanegra."],
            "continent": "América",
            "population": 393244
        },
        {
            "id": "barbados",
            "nombre": "Barbados",
            "sinonimos": ["la pequeña inglaterra"],
            "latitud": 13.1939,
            "longitud": -59.5432,
            "bandera": "🇧🇧",
            "descripcionGeneral": "La isla más oriental del Caribe, conocida por sus playas de surf, cuevas y cultura del ron.",
            "cultura": "Tierra natal de Rihanna y considerada la cuna del ron moderno.",
            "datosCuriosos": ["El pomelo (toronja) fue descubierto aquí.", "Es una isla de coral, lo que filtra su agua haciéndola muy pura."],
            "continent": "América",
            "population": 287375
        },
        {
            "id": "trinidad_y_tobago",
            "nombre": "Trinidad y Tobago",
            "sinonimos": ["t&t"],
            "latitud": 10.6918,
            "longitud": -61.2225,
            "bandera": "🇹🇹",
            "descripcionGeneral": "Nación de dos islas cerca de Venezuela, famosa por su biodiversidad y su carnaval.",
            "cultura": "Inventaron el tambor metálico (Steelpan), el baile del limbo y la música Calipso.",
            "datosCuriosos": ["Tiene el lago de asfalto natural más grande del mundo.", "El chile Moruga Scorpion, uno de los más picantes, es de aquí."],
            "continent": "América",
            "population": 1399488
        },
        {
                "id": "colombia",
                "nombre": "Colombia",
                "sinonimos": ["tierra del café", "república de colombia"],
                "latitud": 4.5709,
                "longitud": -74.2973,
                "bandera": "🇨🇴",
                "descripcionGeneral": "País en la esquina norte de Sudamérica, único con costas en el Pacífico y el Caribe.",
                "cultura": "Famoso por el realismo mágico de Gabriel García Márquez, la cumbia, el vallenato y el mejor café suave del mundo.",
                "datosCuriosos": ["Es el mayor productor de esmeraldas del planeta.", "Su himno nacional es considerado uno de los más bellos del mundo."],
                "continent": "América",
                "population": 50882891
            },
            {
                "id": "venezuela",
                "nombre": "Venezuela",
                "sinonimos": ["república bolivariana de venezuela"],
                "latitud": 6.4238,
                "longitud": -66.5897,
                "bandera": "🇻🇪",
                "descripcionGeneral": "País con una biodiversidad increíble, desde playas caribeñas hasta la selva amazónica y montañas andinas.",
                "cultura": "Conocido por el sistema de orquestas juveniles, el joropo y su pasión por el béisbol.",
                "datosCuriosos": ["Tiene la caída de agua ininterrumpida más alta del mundo: el Salto Ángel.", "El relámpago del Catatumbo es un fenómeno meteorológico único que ocurre casi todas las noches."],
                "continent": "América",
                "population": 28435940
            },
            {
                "id": "guyana",
                "nombre": "Guyana",
                "sinonimos": ["guayana"],
                "latitud": 4.8604,
                "longitud": -58.9302,
                "bandera": "🇬🇾",
                "descripcionGeneral": "Nación densamente boscosa en la costa del Atlántico Norte, con una fuerte herencia caribeña.",
                "cultura": "Es el único país de Sudamérica donde el idioma oficial es el inglés. Famoso por el cricket y el calipso.",
                "datosCuriosos": ["Alberga las cataratas Kaieteur, una de las caídas de agua más poderosas del mundo.", "La gran mayoría de su territorio es selva virgen."],
                "continent": "América",
                "population": 786552
            },
            {
                "id": "surinam",
                "nombre": "Surinam",
                "sinonimos": ["suriname"],
                "latitud": 3.9193,
                "longitud": -56.0278,
                "bandera": "🇸🇷",
                "descripcionGeneral": "Pequeño país en la costa noreste, conocido por su increíble diversidad étnica y grandes reservas naturales.",
                "cultura": "Es el único país de América donde se habla neerlandés (holandés) oficialmente.",
                "datosCuriosos": ["Es uno de los países más boscosos del mundo (90% selva).", "En su capital conviven una mezquita y una sinagoga una al lado de la otra."],
                "continent": "América",
                "population": 586632
            },
            {
                "id": "ecuador",
                "nombre": "Ecuador",
                "sinonimos": ["la mitad del mundo"],
                "latitud": -1.8312,
                "longitud": -78.1834,
                "bandera": "🇪🇨",
                "descripcionGeneral": "País andino nombrado por la línea ecuatorial que lo atraviesa, dueño de las Islas Galápagos.",
                "cultura": "Famoso por sus mercados indígenas coloridos y por ser el mayor exportador de bananas del mundo.",
                "datosCuriosos": ["El volcán Chimborazo es el punto más cercano al sol (debido a la forma de la Tierra).", "Las Islas Galápagos inspiraron la teoría de la evolución de Darwin."],
                "continent": "América",
                "population": 17643054
            },
            {
                "id": "peru",
                "nombre": "Perú",
                "sinonimos": ["tierra de los incas"],
                "latitud": -9.1900,
                "longitud": -75.0152,
                "bandera": "🇵🇪",
                "descripcionGeneral": "Hogar de una sección del Amazonas y de Machu Picchu, una antigua ciudad inca en las alturas de los Andes.",
                "cultura": "Su gastronomía es aclamada mundialmente (ceviche). Cuna del Imperio Inca.",
                "datosCuriosos": ["La papa es originaria de aquí, cultivan más de 3,000 variedades.", "El Cañón del Colca es dos veces más profundo que el Gran Cañón de EE.UU."],
                "continent": "América",
                "population": 32971854
            },
            {
                "id": "brasil",
                "nombre": "Brasil",
                "sinonimos": ["brasil", "o gigante"],
                "latitud": -14.2350,
                "longitud": -51.9253,
                "bandera": "🇧🇷",
                "descripcionGeneral": "El país más grande de Sudamérica, abarca gran parte de la Amazonia y tiene playas icónicas.",
                "cultura": "Mundialmente famoso por el Carnaval de Río, la samba, la bossa nova y el fútbol.",
                "datosCuriosos": ["Es el mayor productor de café del mundo desde hace 150 años.", "El río Amazonas es el más caudaloso del planeta."],
                "continent": "América",
                "population": 212559417
            },
            {
                "id": "bolivia",
                "nombre": "Bolivia",
                "sinonimos": ["estado plurinacional de bolivia"],
                "latitud": -16.2902,
                "longitud": -63.5887,
                "bandera": "🇧🇴",
                "descripcionGeneral": "País sin salida al mar en el centro de Sudamérica, con terrenos que van desde los Andes hasta el desierto de Atacama.",
                "cultura": "Tiene la mayor población indígena de Sudamérica y el Lago Titicaca, el lago navegable más alto del mundo.",
                "datosCuriosos": ["El Salar de Uyuni es el espejo natural más grande del mundo.", "Tiene 37 idiomas oficiales."],
                "continent": "América",
                "population": 11673021
            },
            {
                "id": "paraguay",
                "nombre": "Paraguay",
                "sinonimos": ["corazón de américa"],
                "latitud": -23.4425,
                "longitud": -58.4438,
                "bandera": "🇵🇾",
                "descripcionGeneral": "País sin litoral, dividido por el río Paraguay, conocido por sus grandes extensiones de pantanos y bosques.",
                "cultura": "Es un país bilingüe (Guaraní y Español). Famoso por el tereré (bebida de yerba mate fría) y el arpa paraguaya.",
                "datosCuriosos": ["Su bandera es la única en el mundo con dos escudos diferentes (anverso y reverso).", "Comparte la represa de Itaipú, una de las más grandes del mundo."],
                "continent": "América",
                "population": 7132538
            },
            {
                "id": "chile",
                "nombre": "Chile",
                "sinonimos": ["el país más largo"],
                "latitud": -35.6751,
                "longitud": -71.5430,
                "bandera": "🇨🇱",
                "descripcionGeneral": "Una franja larga y angosta de tierra entre los Andes y el Pacífico.",
                "cultura": "Tierra de poetas ganadores del Nobel (Neruda, Mistral) y excelentes vinos.",
                "datosCuriosos": ["Posee el lugar más árido de la Tierra: el Desierto de Atacama.", "Es el país más largo del mundo de norte a sur."],
                "continent": "América",
                "population": 19116201
            },
            {
                "id": "argentina",
                "nombre": "Argentina",
                "sinonimos": ["tierra de plata"],
                "latitud": -38.4161,
                "longitud": -63.6167,
                "bandera": "🇦🇷",
                "descripcionGeneral": "Enorme nación sudamericana con terrenos que incluyen las montañas de los Andes, lagos glaciares y la pampa.",
                "cultura": "Famosa por el tango, el asado, el mate y su pasión desbordada por el fútbol.",
                "datosCuriosos": ["Tiene la avenida más ancha del mundo (9 de Julio).", "Aquí se inventó el sistema de identificación por huellas dactilares."],
                "continent": "América",
                "population": 45195777
            },
            {
                "id": "uruguay",
                "nombre": "Uruguay",
                "sinonimos": ["la suiza de américa"],
                "latitud": -32.5228,
                "longitud": -55.7658,
                "bandera": "🇺🇾",
                "descripcionGeneral": "Pequeño país conocido por su interior verde y costa llena de playas. Muy estable y progresista.",
                "cultura": "Comparten la cultura del mate y el asado. Famosos por el Carnaval más largo del mundo (40 días).",
                "datosCuriosos": ["Es el país más secular (menos religioso) de América Latina.", "Fue el anfitrión y ganador del primer mundial de fútbol en 1930."],
                "continent": "América",
                "population": 3473730
            },
            {
                    "id": "portugal",
                    "nombre": "Portugal",
                    "sinonimos": ["lusitania"],
                    "latitud": 39.3999,
                    "longitud": -8.2245,
                    "bandera": "🇵🇹",
                    "descripcionGeneral": "Nación costera en el suroeste de Europa, famosa por sus playas del Algarve y arquitectura manuelina.",
                    "cultura": "Hogar del Fado (música nostálgica) y de exploradores históricos. Aman el bacalao.",
                    "datosCuriosos": ["Es el país más antiguo de Europa con fronteras definidas.", "Producen la mitad del corcho del mundo."],
                    "continent": "Europa",
                    "population": 10196709
                },
                {
                    "id": "espana",
                    "nombre": "España",
                    "sinonimos": ["reino de españa", "la piel de toro"],
                    "latitud": 40.4637,
                    "longitud": -3.7492,
                    "bandera": "🇪🇸",
                    "descripcionGeneral": "País vibrante del sur de Europa con una rica historia imperial y gran diversidad regional.",
                    "cultura": "Cuna del flamenco, las tapas y la siesta. Hogar de artistas como Picasso y Dalí.",
                    "datosCuriosos": ["Es el país con más bares por habitante de la Unión Europea.", "Producen cerca del 45% del aceite de oliva del mundo."],
                    "continent": "Europa",
                    "population": 47351567
                },
                {
                    "id": "francia",
                    "nombre": "Francia",
                    "sinonimos": ["república francesa", "galo"],
                    "latitud": 46.2276,
                    "longitud": 2.2137,
                    "bandera": "🇫🇷",
                    "descripcionGeneral": "El país más grande de la Unión Europea, sinónimo de arte, moda y gastronomía refinada.",
                    "cultura": "Líder mundial en lujo y cocina. Hogar del Louvre y la Torre Eiffel.",
                    "datosCuriosos": ["Es el país más visitado del mundo.", "Inventaron el cine y el sistema métrico."],
                    "continent": "Europa",
                    "population": 67391582
                },
                {
                    "id": "reino_unido",
                    "nombre": "Reino Unido",
                    "sinonimos": ["uk", "gran bretaña", "inglaterra"],
                    "latitud": 55.3781,
                    "longitud": -3.4360,
                    "bandera": "🇬🇧",
                    "descripcionGeneral": "Nación insular histórica compuesta por Inglaterra, Escocia, Gales e Irlanda del Norte.",
                    "cultura": "Cuna de Shakespeare, los Beatles, Harry Potter y la Revolución Industrial.",
                    "datosCuriosos": ["El Rey es dueño legal de todos los cisnes del río Támesis.", "En Londres se hablan más de 300 idiomas."],
                    "continent": "Europa",
                    "population": 67215293
                },
                {
                    "id": "irlanda",
                    "nombre": "Irlanda",
                    "sinonimos": ["la isla esmeralda"],
                    "latitud": 53.1424,
                    "longitud": -7.6921,
                    "bandera": "🇮🇪",
                    "descripcionGeneral": "Isla famosa por sus paisajes verdes exuberantes, castillos y hospitalidad.",
                    "cultura": "Conocida por la música folk, los pubs, la cerveza Guinness y la literatura.",
                    "datosCuriosos": ["Halloween se originó aquí (festival de Samhain).", "No hay serpientes en la isla."],
                    "continent": "Europa",
                    "population": 4994724
                },
                {
                    "id": "belgica",
                    "nombre": "Bélgica",
                    "sinonimos": ["corazón de europa"],
                    "latitud": 50.5039,
                    "longitud": 4.4699,
                    "bandera": "🇧🇪",
                    "descripcionGeneral": "Pequeño país moderno, sede de la Unión Europea y la OTAN.",
                    "cultura": "Mundialmente famosa por sus chocolates, gofres, patatas fritas y cientos de tipos de cerveza.",
                    "datosCuriosos": ["Producen más de 220,000 toneladas de chocolate al año.", "Aquí se inventó el saxofón."],
                    "continent": "Europa",
                    "population": 11589616
                },
                {
                    "id": "paises_bajos",
                    "nombre": "Países Bajos",
                    "sinonimos": ["holanda", "nederland"],
                    "latitud": 52.1326,
                    "longitud": 5.2913,
                    "bandera": "🇳🇱",
                    "descripcionGeneral": "País conocido por su paisaje plano, canales, campos de tulipanes y molinos de viento.",
                    "cultura": "Líderes en ciclismo urbano y gestión del agua. Famosos por pintores como Van Gogh.",
                    "datosCuriosos": ["Tienen los hombres más altos del mundo en promedio.", "Hay más bicicletas que personas."],
                    "continent": "Europa",
                    "population": 17441139
                },
                {
                    "id": "alemania",
                    "nombre": "Alemania",
                    "sinonimos": ["germania", "deutschland"],
                    "latitud": 52.5186,
                    "longitud": 13.3762,
                    "bandera": "🇩🇪",
                    "descripcionGeneral": "La mayor economía de Europa, conocida por su ingeniería, historia y densos bosques.",
                    "cultura": "Tierra de Bach y Beethoven. Famosa por sus festivales (Oktoberfest) y eficiencia.",
                    "datosCuriosos": ["Hay más de 1,500 tipos de salchichas.", "La autopista Autobahn no tiene límite de velocidad en muchos tramos."],
                    "continent": "Europa",
                    "population": 83240525
                },
                {
                    "id": "suiza",
                    "nombre": "Suiza",
                    "sinonimos": ["confederación helvética"],
                    "latitud": 46.8182,
                    "longitud": 8.2275,
                    "bandera": "🇨🇭",
                    "descripcionGeneral": "País montañoso en los Alpes, famoso por su neutralidad política y paisajes de postal.",
                    "cultura": "Conocida por sus relojes de lujo, chocolates finos, quesos y bancos.",
                    "datosCuriosos": ["Su bandera es cuadrada, no rectangular.", "Tienen búnkeres nucleares capaces de albergar a toda su población."],
                    "continent": "Europa",
                    "population": 8654618
                },
                {
                    "id": "italia",
                    "nombre": "Italia",
                    "sinonimos": ["la bota", "república italiana"],
                    "latitud": 41.8719,
                    "longitud": 12.5674,
                    "bandera": "🇮🇹",
                    "descripcionGeneral": "País mediterráneo con forma de bota, cuna del Imperio Romano y el Renacimiento.",
                    "cultura": "Posiblemente la gastronomía más amada del mundo (pizza, pasta). Centro de moda y arte.",
                    "datosCuriosos": ["Tiene más sitios Patrimonio de la Humanidad de la UNESCO que cualquier otro país.", "Inventaron el piano y las gafas."],
                    "continent": "Europa",
                    "population": 59554023
                },
                {
                    "id": "grecia",
                    "nombre": "Grecia",
                    "sinonimos": ["hélade"],
                    "latitud": 39.0742,
                    "longitud": 21.8243,
                    "bandera": "🇬🇷",
                    "descripcionGeneral": "Cuna de la civilización occidental, famosa por sus ruinas antiguas y hermosas islas.",
                    "cultura": "Lugar de nacimiento de la democracia, la filosofía y los Juegos Olímpicos.",
                    "datosCuriosos": ["El sol brilla más de 250 días al año.", "Tienen miles de islas, pero solo unas 200 están habitadas."],
                    "continent": "Europa",
                    "population": 10423056
                },
                {
                    "id": "austria",
                    "nombre": "Austria",
                    "sinonimos": ["österreich"],
                    "latitud": 47.5162,
                    "longitud": 14.5501,
                    "bandera": "🇦🇹",
                    "descripcionGeneral": "País alpino de habla alemana, famoso por su arquitectura imperial y música clásica.",
                    "cultura": "Cuna de Mozart y Strauss. Viena es famosa por sus cafés y óperas.",
                    "datosCuriosos": ["El croissant se originó aquí (Viena), no en Francia.", "Hogar de la cueva de hielo más grande del mundo."],
                    "continent": "Europa",
                    "population": 9006400
                },
                {
                    "id": "polonia",
                    "nombre": "Polonia",
                    "sinonimos": ["polska"],
                    "latitud": 51.9194,
                    "longitud": 19.1451,
                    "bandera": "🇵🇱",
                    "descripcionGeneral": "País de Europa Central con una historia de resiliencia y rica herencia medieval.",
                    "cultura": "Cuna de Chopin y Copérnico. Amantes de las sopas y los pierogi.",
                    "datosCuriosos": ["El nombre del país significa 'gente de campo abierto'.", "Es uno de los mayores exportadores de ámbar del mundo."],
                    "continent": "Europa",
                    "population": 37846611
                },
                {
                    "id": "republica_checa",
                    "nombre": "República Checa",
                    "sinonimos": ["chequia"],
                    "latitud": 49.8175,
                    "longitud": 15.4730,
                    "bandera": "🇨🇿",
                    "descripcionGeneral": "País sin litoral conocido por sus castillos ornamentados y cervezas nativas.",
                    "cultura": "Praga es considerada una de las ciudades más bellas. Inventaron la palabra 'Robot'.",
                    "datosCuriosos": ["Consumen más cerveza per cápita que cualquier otro país.", "Tienen la mayor densidad de castillos de Europa."],
                    "continent": "Europa",
                    "population": 10708982
                },
                {
                    "id": "suecia",
                    "nombre": "Suecia",
                    "sinonimos": ["sverige"],
                    "latitud": 60.1282,
                    "longitud": 18.6435,
                    "bandera": "🇸🇪",
                    "descripcionGeneral": "Nación escandinava conocida por sus miles de islas costeras, lagos y bosques.",
                    "cultura": "Hogar de los Premios Nobel, el grupo ABBA y empresas como IKEA y Spotify.",
                    "datosCuriosos": ["Importan basura de otros países para generar energía.", "Tienen un hotel hecho completamente de hielo que se reconstruye cada año."],
                    "continent": "Europa",
                    "population": 10353442
                },
                {
                    "id": "noruega",
                    "nombre": "Noruega",
                    "sinonimos": ["norge"],
                    "latitud": 60.4720,
                    "longitud": 8.4689,
                    "bandera": "🇳🇴",
                    "descripcionGeneral": "País escandinavo famoso por sus espectaculares fiordos, montañas y auroras boreales.",
                    "cultura": "Tierra de vikingos y deportes de invierno. Líderes en autos eléctricos.",
                    "datosCuriosos": ["El sushi de salmón fue inventado por noruegos para vender pescado a Japón.", "El caballero de la guardia real es un pingüino."],
                    "continent": "Europa",
                    "population": 5379475
                },
                {
                    "id": "dinamarca",
                    "nombre": "Dinamarca",
                    "sinonimos": ["danmark"],
                    "latitud": 56.2639,
                    "longitud": 9.5018,
                    "bandera": "🇩🇰",
                    "descripcionGeneral": "País nórdico que une a Escandinavia con Europa continental.",
                    "cultura": "Cuna de los cuentos de Hans Christian Andersen y los bloques LEGO.",
                    "datosCuriosos": ["Tiene la bandera más antigua del mundo aún en uso.", "No hay montañas, es un país muy plano."],
                    "continent": "Europa",
                    "population": 5831404
                },
                {
                    "id": "finlandia",
                    "nombre": "Finlandia",
                    "sinonimos": ["suomi"],
                    "latitud": 61.9241,
                    "longitud": 25.7482,
                    "bandera": "🇫🇮",
                    "descripcionGeneral": "Nación del norte de Europa que limita con Suecia, Noruega y Rusia.",
                    "cultura": "Famosa por tener el mejor sistema educativo y por inventar la sauna.",
                    "datosCuriosos": ["Tienen más saunas que coches.", "Es considerado el país más feliz del mundo año tras año."],
                    "continent": "Europa",
                    "population": 5530719
                },
                {
                    "id": "islandia",
                    "nombre": "Islandia",
                    "sinonimos": ["tierra de hielo y fuego"],
                    "latitud": 64.9631,
                    "longitud": -19.0208,
                    "bandera": "🇮🇸",
                    "descripcionGeneral": "Isla nórdica definida por su espectacular paisaje de volcanes, géiseres y campos de lava.",
                    "cultura": "Tienen una fuerte tradición literaria y creen en la gente oculta (elfos).",
                    "datosCuriosos": ["No hay mosquitos en Islandia.", "Usan energía geotérmica para calentar casi todo."],
                    "continent": "Europa",
                    "population": 366425
                },
                {
                    "id": "rusia",
                    "nombre": "Rusia",
                    "sinonimos": ["federación rusa"],
                    "latitud": 61.5240,
                    "longitud": 105.3188,
                    "bandera": "🇷🇺",
                    "descripcionGeneral": "El país más grande del mundo, extendiéndose por Europa del Este y el norte de Asia.",
                    "cultura": "Famosa por el ballet (Bolshoi), la literatura profunda (Tolstoy) y su arquitectura colorida.",
                    "datosCuriosos": ["Tiene 11 zonas horarias diferentes.", "El lago Baikal contiene el 20% del agua dulce no congelada del mundo."],
                    "continent": "Europa",
                    "population": 144104080
                },
                {
                    "id": "ucrania",
                    "nombre": "Ucrania",
                    "sinonimos": ["ukraine"],
                    "latitud": 48.3794,
                    "longitud": 31.1656,
                    "bandera": "🇺🇦",
                    "descripcionGeneral": "Gran país de Europa del Este conocido por sus iglesias ortodoxas, costa en el Mar Negro y montañas.",
                    "cultura": "Famosa por sus bordados tradicionales y por ser el 'granero de Europa' por su trigo.",
                    "datosCuriosos": ["Tiene la estación de metro más profunda del mundo (Arsenalna).", "El famoso 'Túnel del Amor' está aquí."],
                    "continent": "Europa",
                    "population": 43733762
                },
                {
                        "id": "estonia",
                        "nombre": "Estonia",
                        "sinonimos": ["eesti"],
                        "latitud": 58.5953,
                        "longitud": 25.0136,
                        "bandera": "🇪🇪",
                        "descripcionGeneral": "País del norte de Europa con una de las sociedades más digitales del mundo.",
                        "cultura": "Famosos por sus saunas y por ser el lugar de nacimiento de Skype.",
                        "datosCuriosos": ["El acceso a internet es considerado un derecho humano.", "Tienen una competición de cargar a la esposa."],
                        "continent": "Europa",
                        "population": 1331057
                    },
                    {
                        "id": "letonia",
                        "nombre": "Letonia",
                        "sinonimos": ["latvia"],
                        "latitud": 56.8796,
                        "longitud": 24.6032,
                        "bandera": "🇱🇻",
                        "descripcionGeneral": "País báltico conocido por sus extensos bosques y playas de arena blanca.",
                        "cultura": "Su capital, Riga, tiene la mayor concentración de arquitectura Art Nouveau del mundo.",
                        "datosCuriosos": ["Tienen una de las mujeres más altas del mundo en promedio.", "La bandera es una de las más antiguas en uso."],
                        "continent": "Europa",
                        "population": 1886198
                    },
                    {
                        "id": "lituania",
                        "nombre": "Lituania",
                        "sinonimos": ["lietuva"],
                        "latitud": 55.1694,
                        "longitud": 23.8813,
                        "bandera": "🇱🇹",
                        "descripcionGeneral": "El más grande de los estados bálticos, con una rica historia medieval.",
                        "cultura": "El baloncesto es como una segunda religión aquí. Aman la sopa de remolacha fría.",
                        "datosCuriosos": ["Fue la última nación de Europa en convertirse al cristianismo.", "Tiene su propio aroma nacional oficial."],
                        "continent": "Europa",
                        "population": 2722289
                    },
                    {
                        "id": "bielorrusia",
                        "nombre": "Bielorrusia",
                        "sinonimos": ["belarús"],
                        "latitud": 53.7098,
                        "longitud": 27.9534,
                        "bandera": "🇧🇾",
                        "descripcionGeneral": "País de Europa del Este sin salida al mar, conocido por su arquitectura estalinista y bosques.",
                        "cultura": "Famoso por sus tractores y la producción de potasa. El hockey sobre hielo es muy popular.",
                        "datosCuriosos": ["El 40% del país está cubierto de bosques.", "Es el hogar del bisonte europeo."],
                        "continent": "Europa",
                        "population": 9398861
                    },
                    {
                        "id": "moldavia",
                        "nombre": "Moldavia",
                        "sinonimos": ["moldova"],
                        "latitud": 47.4116,
                        "longitud": 28.3699,
                        "bandera": "🇲🇩",
                        "descripcionGeneral": "Pequeño país entre Rumania y Ucrania, conocido por sus viñedos y bodegas.",
                        "cultura": "Tiene una cultura del vino muy arraigada y monasterios antiguos.",
                        "datosCuriosos": ["Alberga la bodega de vino más grande del mundo (Milestii Mici).", "Es el país menos visitado de Europa."],
                        "continent": "Europa",
                        "population": 2640438
                    },
                    {
                        "id": "rumania",
                        "nombre": "Rumania",
                        "sinonimos": ["romania"],
                        "latitud": 45.9432,
                        "longitud": 24.9668,
                        "bandera": "🇷🇴",
                        "descripcionGeneral": "País del sureste europeo conocido por la región boscosa de Transilvania.",
                        "cultura": "Hogar de la leyenda de Drácula y castillos medievales impresionantes.",
                        "datosCuriosos": ["Tienen el edificio administrativo civil más pesado del mundo (Palacio del Parlamento).", "El idioma rumano es romance, parecido al italiano."],
                        "continent": "Europa",
                        "population": 19286123
                    },
                    {
                        "id": "bulgaria",
                        "nombre": "Bulgaria",
                        "sinonimos": ["tierra de rosas"],
                        "latitud": 42.7339,
                        "longitud": 25.4858,
                        "bandera": "🇧🇬",
                        "descripcionGeneral": "Nación balcánica con terreno diverso que incluye costa en el Mar Negro y montañas.",
                        "cultura": "Famosa por producir la mayor parte del aceite de rosas del mundo y por su yogur.",
                        "datosCuriosos": ["Los búlgaros asienten para decir 'no' y niegan con la cabeza para decir 'sí'.", "Es el país más antiguo de Europa que no ha cambiado de nombre."],
                        "continent": "Europa",
                        "population": 6927288
                    },
                    {
                        "id": "hungria",
                        "nombre": "Hungría",
                        "sinonimos": ["magiar"],
                        "latitud": 47.1625,
                        "longitud": 19.5033,
                        "bandera": "🇭🇺",
                        "descripcionGeneral": "País sin litoral en Europa Central, famoso por su capital Budapest y el río Danubio.",
                        "cultura": "Conocidos por sus baños termales, el Goulash y la invención del cubo de Rubik.",
                        "datosCuriosos": ["Tiene uno de los metros más antiguos del mundo.", "El idioma húngaro es uno de los más difíciles de aprender."],
                        "continent": "Europa",
                        "population": 9660350
                    },
                    {
                        "id": "eslovaquia",
                        "nombre": "Eslovaquia",
                        "sinonimos": ["slovakia"],
                        "latitud": 48.6690,
                        "longitud": 19.6990,
                        "bandera": "🇸🇰",
                        "descripcionGeneral": "País de Europa Central conocido por sus paisajes espectaculares y castillos.",
                        "cultura": "Tiene la mayor densidad de castillos per cápita del mundo.",
                        "datosCuriosos": ["Es el mayor productor de automóviles per cápita del mundo.", "La capital, Bratislava, limita con dos países (Austria y Hungría)."],
                        "continent": "Europa",
                        "population": 5458827
                    },
                    {
                        "id": "eslovenia",
                        "nombre": "Eslovenia",
                        "sinonimos": ["slovenija"],
                        "latitud": 46.1512,
                        "longitud": 14.9955,
                        "bandera": "🇸🇮",
                        "descripcionGeneral": "País conocido por sus montañas, estaciones de esquí y lagos como el Bled.",
                        "cultura": "Amantes de la apicultura y la naturaleza. Es muy verde y limpio.",
                        "datosCuriosos": ["Hay un viñedo por cada 70 personas.", "Su capital se llama Liubliana, que significa 'La Amada'."],
                        "continent": "Europa",
                        "population": 2078938
                    },
                    {
                        "id": "croacia",
                        "nombre": "Croacia",
                        "sinonimos": ["hrvatska"],
                        "latitud": 45.1000,
                        "longitud": 15.2000,
                        "bandera": "🇭🇷",
                        "descripcionGeneral": "País en la costa del Adriático, famoso por sus miles de islas y ciudades amuralladas.",
                        "cultura": "Conocido por Dubrovnik (escenario de Game of Thrones) y los perros dálmatas.",
                        "datosCuriosos": ["Aquí se inventó la corbata.", "Tiene la ciudad más pequeña del mundo, llamada Hum."],
                        "continent": "Europa",
                        "population": 4047200
                    },
                    {
                        "id": "bosnia_y_herzegovina",
                        "nombre": "Bosnia y Herzegovina",
                        "sinonimos": ["bosnia"],
                        "latitud": 43.9159,
                        "longitud": 17.6791,
                        "bandera": "🇧🇦",
                        "descripcionGeneral": "País en la península balcánica conocido por sus ríos, montañas y el puente de Mostar.",
                        "cultura": "Una mezcla única de culturas orientales y occidentales, famosa por su café.",
                        "datosCuriosos": ["Sarajevo fue la primera ciudad de Europa en tener tranvía eléctrico.", "Tiene uno de los últimos bosques primarios de Europa (Perućica)."],
                        "continent": "Europa",
                        "population": 3280815
                    },
                    {
                        "id": "serbia",
                        "nombre": "Serbia",
                        "sinonimos": ["srbija"],
                        "latitud": 44.0165,
                        "longitud": 21.0059,
                        "bandera": "🇷🇸",
                        "descripcionGeneral": "País sin salida al mar en los Balcanes, con mesetas al norte y montañas al sur.",
                        "cultura": "Conocidos por su hospitalidad, la vida nocturna en Belgrado y el tenis (Djokovic).",
                        "datosCuriosos": ["Es uno de los mayores exportadores de frambuesas del mundo.", "18 emperadores romanos nacieron en lo que hoy es Serbia."],
                        "continent": "Europa",
                        "population": 6908224
                    },
                    {
                        "id": "montenegro",
                        "nombre": "Montenegro",
                        "sinonimos": ["crna gora"],
                        "latitud": 42.7087,
                        "longitud": 19.3744,
                        "bandera": "🇲🇪",
                        "descripcionGeneral": "Pequeño país balcánico con montañas escarpadas y villas medievales en la costa.",
                        "cultura": "Famoso por la Bahía de Kotor y sus playas espectaculares.",
                        "datosCuriosos": ["Su nombre significa 'Montaña Negra'.", "Tiene el cañón más profundo de Europa (Tara)."],
                        "continent": "Europa",
                        "population": 621718
                    },
                    {
                        "id": "macedonia_del_norte",
                        "nombre": "Macedonia del Norte",
                        "sinonimos": ["macedonia"],
                        "latitud": 41.6086,
                        "longitud": 21.7453,
                        "bandera": "🇲🇰",
                        "descripcionGeneral": "País sin litoral en los Balcanes, definido por montañas, lagos y ciudades antiguas.",
                        "cultura": "Lugar de nacimiento de la Madre Teresa. Famoso por el Lago Ohrid.",
                        "datosCuriosos": ["Tiene más picos de montaña que cualquier otro país de la región.", "El opio macedonio es considerado uno de los de mayor calidad."],
                        "continent": "Europa",
                        "population": 2083380
                    },
                    {
                        "id": "albania",
                        "nombre": "Albania",
                        "sinonimos": ["shqipëria"],
                        "latitud": 41.1533,
                        "longitud": 20.1683,
                        "bandera": "🇦🇱",
                        "descripcionGeneral": "País en el sureste de Europa con costa en el Adriático y Jónico, y Alpes albaneses.",
                        "cultura": "Conocidos por su código de honor 'Besa' y su lengua única.",
                        "datosCuriosos": ["Hay cientos de miles de búnkeres de hormigón abandonados.", "No hay McDonald's en el país."],
                        "continent": "Europa",
                        "population": 2837743
                    },
                    {
                        "id": "luxemburgo",
                        "nombre": "Luxemburgo",
                        "sinonimos": ["gran ducado"],
                        "latitud": 49.8153,
                        "longitud": 6.1296,
                        "bandera": "🇱🇺",
                        "descripcionGeneral": "Pequeño país europeo rodeado por Bélgica, Francia y Alemania.",
                        "cultura": "Es el único Gran Ducado del mundo. Muy rico y multilingüe.",
                        "datosCuriosos": ["El transporte público es gratuito en todo el país.", "Tiene el salario mínimo más alto de la UE."],
                        "continent": "Europa",
                        "population": 632275
                    },
                    {
                        "id": "malta",
                        "nombre": "Malta",
                        "sinonimos": ["república de malta"],
                        "latitud": 35.9375,
                        "longitud": 14.3754,
                        "bandera": "🇲🇹",
                        "descripcionGeneral": "Archipiélago en el Mediterráneo central, conocido por sitios históricos de muchos gobernantes.",
                        "cultura": "Famoso por los Caballeros de Malta y sus aguas cristalinas para bucear.",
                        "datosCuriosos": ["Se maneja por la izquierda (herencia británica).", "Ha sido escenario de películas como Gladiador y Troya."],
                        "continent": "Europa",
                        "population": 441543
                    },
                    {
                        "id": "chipre",
                        "nombre": "Chipre",
                        "sinonimos": ["cyprus"],
                        "latitud": 35.1264,
                        "longitud": 33.4299,
                        "bandera": "🇨🇾",
                        "descripcionGeneral": "Nación insular en el Mediterráneo oriental, famosa por sus playas y ruinas antiguas.",
                        "cultura": "Legendario lugar de nacimiento de Afrodita. Mezcla cultural griega y turca.",
                        "datosCuriosos": ["Es el único país que muestra su mapa en su bandera.", "Tienen el vino más antiguo del mundo aún en producción (Commandaria)."],
                        "continent": "Europa",
                        "population": 1207361
                    },
                    {
                        "id": "andorra",
                        "nombre": "Andorra",
                        "sinonimos": ["principado de andorra"],
                        "latitud": 42.5063,
                        "longitud": 1.5218,
                        "bandera": "🇦🇩",
                        "descripcionGeneral": "Pequeño principado independiente ubicado entre Francia y España en los Pirineos.",
                        "cultura": "Conocido por sus estaciones de esquí y por ser un paraíso fiscal.",
                        "datosCuriosos": ["Es el único país donde el catalán es el único idioma oficial.", "No tiene aeropuerto ni ejército."],
                        "continent": "Europa",
                        "population": 77265
                    },
                    {
                        "id": "monaco",
                        "nombre": "Mónaco",
                        "sinonimos": ["principado de mónaco"],
                        "latitud": 43.7384,
                        "longitud": 7.4246,
                        "bandera": "🇲🇨",
                        "descripcionGeneral": "Ciudad-estado soberana en la Riviera francesa, conocida por su lujo.",
                        "cultura": "Hogar del Gran Premio de F1 y casinos famosos (donde los locales no pueden apostar).",
                        "datosCuriosos": ["Es el segundo país más pequeño del mundo.", "Tiene la mayor densidad de millonarios del planeta."],
                        "continent": "Europa",
                        "population": 39244
                    },
                    {
                        "id": "liechtenstein",
                        "nombre": "Liechtenstein",
                        "sinonimos": ["principado de liechtenstein"],
                        "latitud": 47.1660,
                        "longitud": 9.5554,
                        "bandera": "🇱🇮",
                        "descripcionGeneral": "Principado de habla alemana entre Austria y Suiza.",
                        "cultura": "Conocido por sus castillos medievales, paisajes alpinos y sellos postales.",
                        "datosCuriosos": ["Es el mayor productor mundial de dientes falsos.", "Es uno de los dos países 'doblemente sin litoral' del mundo."],
                        "continent": "Europa",
                        "population": 38137
                    },
                    {
                        "id": "san_marino",
                        "nombre": "San Marino",
                        "sinonimos": ["república serenísima"],
                        "latitud": 43.9424,
                        "longitud": 12.4578,
                        "bandera": "🇸🇲",
                        "descripcionGeneral": "Microestado montañoso rodeado por Italia.",
                        "cultura": "Es la república constitucional más antigua del mundo.",
                        "datosCuriosos": ["Tiene más coches que personas.", "Lincoln fue ciudadano honorario."],
                        "continent": "Europa",
                        "population": 33938
                    },
                    {
                        "id": "vaticano",
                        "nombre": "Ciudad del Vaticano",
                        "sinonimos": ["la santa sede", "el vaticano"],
                        "latitud": 41.9029,
                        "longitud": 12.4534,
                        "bandera": "🇻🇦",
                        "descripcionGeneral": "Ciudad-estado rodeada por Roma, sede de la Iglesia Católica Romana.",
                        "cultura": "Hogar del Papa y de arte icónico como la Capilla Sixtina.",
                        "datosCuriosos": ["Es el país más pequeño del mundo.", "Tiene el cajero automático en latín."],
                        "continent": "Europa",
                        "population": 825
                    },
                    {
                            "id": "georgia",
                            "nombre": "Georgia",
                            "sinonimos": ["sakartvelo"],
                            "latitud": 42.3154,
                            "longitud": 43.3569,
                            "bandera": "🇬🇪",
                            "descripcionGeneral": "País en la intersección de Europa y Asia, en las montañas del Cáucaso.",
                            "cultura": "Famosos por su hospitalidad, el canto polifónico y por ser la cuna del vino (8,000 años de historia).",
                            "datosCuriosos": ["Tienen la cueva más profunda del mundo (Veryovkina).", "Su idioma no se parece a ningún otro."],
                            "continent": "Asia",
                            "population": 3714000
                        },
                        {
                            "id": "armenia",
                            "nombre": "Armenia",
                            "sinonimos": ["hayastan"],
                            "latitud": 40.0691,
                            "longitud": 45.0382,
                            "bandera": "🇦🇲",
                            "descripcionGeneral": "Nación montañosa y sin salida al mar en el Cáucaso Sur.",
                            "cultura": "Fue el primer país en adoptar el cristianismo como religión oficial. Famosos por el ajedrez.",
                            "datosCuriosos": ["El ajedrez es una asignatura obligatoria en las escuelas.", "Su símbolo nacional, el Monte Ararat, está en Turquía."],
                            "continent": "Asia",
                            "population": 2963243
                        },
                        {
                            "id": "azerbaiyan",
                            "nombre": "Azerbaiyán",
                            "sinonimos": ["tierra de fuego"],
                            "latitud": 40.1431,
                            "longitud": 47.5769,
                            "bandera": "🇦🇿",
                            "descripcionGeneral": "País rico en petróleo a orillas del Mar Caspio, conocido como la Tierra del Fuego.",
                            "cultura": "Famosos por sus alfombras y la arquitectura moderna de Bakú (las Flame Towers).",
                            "datosCuriosos": ["Tienen volcanes de lodo (la mitad de los que existen en el mundo).", "El fuego de la montaña Yanar Dag nunca se apaga."],
                            "continent": "Asia",
                            "population": 10119100
                        },
                        {
                            "id": "siria",
                            "nombre": "Siria",
                            "sinonimos": ["república árabe siria"],
                            "latitud": 34.8021,
                            "longitud": 38.9968,
                            "bandera": "🇸🇾",
                            "descripcionGeneral": "País con una inmensa riqueza histórica, hogar de algunas de las civilizaciones más antiguas.",
                            "cultura": "Damasco es famosa por sus jazmines, espadas antiguas y zocos (mercados).",
                            "datosCuriosos": ["Damasco es la capital habitada más antigua del mundo.", "El alfabeto ugarítico (uno de los primeros) se encontró aquí."],
                            "continent": "Asia",
                            "population": 17500657
                        },
                        {
                            "id": "libano",
                            "nombre": "Líbano",
                            "sinonimos": ["país de los cedros"],
                            "latitud": 33.8547,
                            "longitud": 35.8623,
                            "bandera": "🇱🇧",
                            "descripcionGeneral": "Pequeño país mediterráneo con montañas nevadas y costa, conocido por su historia fenicia.",
                            "cultura": "Famosos por su gastronomía (hummus, tabbouleh) y vida nocturna vibrante.",
                            "datosCuriosos": ["El nombre del país aparece más de 70 veces en la Biblia.", "Es el único país árabe sin desierto."],
                            "continent": "Asia",
                            "population": 6825442
                        },
                        {
                            "id": "israel",
                            "nombre": "Israel",
                            "sinonimos": ["tierra santa"],
                            "latitud": 31.0461,
                            "longitud": 34.8516,
                            "bandera": "🇮🇱",
                            "descripcionGeneral": "País en el Mediterráneo oriental, considerado Tierra Santa por judíos, cristianos y musulmanes.",
                            "cultura": "Líder mundial en tecnología y startups. Jerusalén es su centro histórico y espiritual.",
                            "datosCuriosos": ["Los tomates cherry se perfeccionaron y comercializaron aquí.", "El Mar Muerto es el punto más bajo de la Tierra."],
                            "continent": "Asia",
                            "population": 9216900
                        },
                        {
                            "id": "jordania",
                            "nombre": "Jordania",
                            "sinonimos": ["reino hachemita"],
                            "latitud": 30.5852,
                            "longitud": 36.2384,
                            "bandera": "🇯🇴",
                            "descripcionGeneral": "Nación árabe en la orilla este del río Jordán, famosa por sus monumentos antiguos.",
                            "cultura": "Conocidos por la hospitalidad beduina y el plato nacional Mansaf.",
                            "datosCuriosos": ["Alberga Petra, la ciudad tallada en roca (una maravilla del mundo).", "Ha sido escenario de películas como 'Misión Rescate' (The Martian)."],
                            "continent": "Asia",
                            "population": 10203140
                        },
                        {
                            "id": "arabia_saudita",
                            "nombre": "Arabia Saudita",
                            "sinonimos": ["el reino"],
                            "latitud": 23.8859,
                            "longitud": 45.0792,
                            "bandera": "🇸🇦",
                            "descripcionGeneral": "El país más grande de Medio Oriente, cuna del Islam y gran productor de energía.",
                            "cultura": "Hogar de La Meca y Medina. Famosos por la cetrería y los caballos árabes.",
                            "datosCuriosos": ["No tiene ríos permanentes en todo el país.", "Están construyendo un edificio de 1 km de altura (Jeddah Tower)."],
                            "continent": "Asia",
                            "population": 34813867
                        },
                        {
                            "id": "yemen",
                            "nombre": "Yemen",
                            "sinonimos": ["arabia feliz"],
                            "latitud": 15.5527,
                            "longitud": 48.5164,
                            "bandera": "🇾🇪",
                            "descripcionGeneral": "País en el extremo sur de la Península Arábiga, con una arquitectura de barro única.",
                            "cultura": "Famosos por sus rascacielos de barro en Shibam y la isla de Socotra.",
                            "datosCuriosos": ["La isla de Socotra tiene árboles 'Sangre de Dragón' que parecen paraguas.", "Es uno de los centros de cultivo de café más antiguos (Moca)."],
                            "continent": "Asia",
                            "population": 29825968
                        },
                        {
                            "id": "oman",
                            "nombre": "Omán",
                            "sinonimos": ["sultanato de omán"],
                            "latitud": 21.4735,
                            "longitud": 55.9754,
                            "bandera": "🇴🇲",
                            "descripcionGeneral": "Sultanato en la costa sureste de la península, con desiertos, oasis y fuertes antiguos.",
                            "cultura": "Famosos por el incienso, los barcos Dhow y las dagas curvas (Khanjar).",
                            "datosCuriosos": ["Es el estado independiente más antiguo del mundo árabe.", "En muchas partes no hay impuestos sobre la renta personal."],
                            "continent": "Asia",
                            "population": 5106622
                        },
                        {
                            "id": "emiratos_arabes_unidos",
                            "nombre": "Emiratos Árabes Unidos",
                            "sinonimos": ["eau", "uae", "dubái"],
                            "latitud": 23.4241,
                            "longitud": 53.8478,
                            "bandera": "🇦🇪",
                            "descripcionGeneral": "Federación de siete emiratos conocida por su arquitectura futurista y lujo.",
                            "cultura": "Mezcla de tradición beduina y modernidad extrema. Carreras de camellos y compras.",
                            "datosCuriosos": ["Tienen el edificio más alto del mundo, el Burj Khalifa.", "La policía de Dubái usa superdeportivos como Ferraris y Lamborghinis."],
                            "continent": "Asia",
                            "population": 9890400
                        },
                        {
                            "id": "catar",
                            "nombre": "Catar",
                            "sinonimos": ["qatar"],
                            "latitud": 25.3548,
                            "longitud": 51.1839,
                            "bandera": "🇶🇦",
                            "descripcionGeneral": "Pequeña península con inmensa riqueza por el gas natural.",
                            "cultura": "Museos de arte islámico de clase mundial y sede del Mundial 2022.",
                            "datosCuriosos": ["Es el país más plano del mundo (apenas tiene colinas).", "El aeropuerto tiene un oso de peluche gigante de 7 millones de dólares."],
                            "continent": "Asia",
                            "population": 2881060
                        },
                        {
                            "id": "barein",
                            "nombre": "Baréin",
                            "sinonimos": ["bahrain", "reino de los dos mares"],
                            "latitud": 26.0667,
                            "longitud": 50.5577,
                            "bandera": "🇧🇭",
                            "descripcionGeneral": "Archipiélago en el Golfo Pérsico, conocido por sus perlas y comercio.",
                            "cultura": "Fue el centro de la antigua civilización Dilmun. Famoso por el Gran Premio de F1.",
                            "datosCuriosos": ["Tiene el 'Árbol de la Vida', que crece en el desierto sin fuente de agua conocida.", "Está conectado a Arabia Saudita por un puente de 25 km."],
                            "continent": "Asia",
                            "population": 1701583
                        },
                        {
                            "id": "kuwait",
                            "nombre": "Kuwait",
                            "sinonimos": ["estado de kuwait"],
                            "latitud": 29.3117,
                            "longitud": 47.4818,
                            "bandera": "🇰🇼",
                            "descripcionGeneral": "País rico en petróleo en la punta del Golfo Pérsico.",
                            "cultura": "Famoso por las 'Diwaniyas', reuniones sociales tradicionales para hombres.",
                            "datosCuriosos": ["El Dinar kuwaití es la moneda más valiosa del mundo.", "No tienen reservas naturales de agua dulce (usan desalinización)."],
                            "continent": "Asia",
                            "population": 4270563
                        },
                        {
                            "id": "irak",
                            "nombre": "Irak",
                            "sinonimos": ["mesopotamia", "cuna de la civilización"],
                            "latitud": 33.2232,
                            "longitud": 43.6793,
                            "bandera": "🇮🇶",
                            "descripcionGeneral": "Hogar de la antigua Mesopotamia, entre los ríos Tigris y Éufrates.",
                            "cultura": "Cuna de la escritura, la rueda y la ley. Famosos por su poesía y té.",
                            "datosCuriosos": ["La escritura (cuneiforme) se inventó aquí hace 5,000 años.", "Bagdad fue la ciudad más grande y rica del mundo en la Edad Media."],
                            "continent": "Asia",
                            "population": 40222503
                        },
                        {
                                "id": "kazajistan",
                                "nombre": "Kazajistán",
                                "sinonimos": ["kazakhstan"],
                                "latitud": 48.0196,
                                "longitud": 66.9237,
                                "bandera": "🇰🇿",
                                "descripcionGeneral": "El país sin salida al mar más grande del mundo, dominado por la inmensa estepa y recursos minerales.",
                                "cultura": "Tierra de nómadas y caballos. Aquí se encuentra el Cosmódromo de Baikonur (desde donde viajan al espacio).",
                                "datosCuriosos": ["Las manzanas son originarias de aquí.", "Es tan grande que toda Europa Occidental cabría dentro."],
                                "continent": "Asia",
                                "population": 18776707
                            },
                            {
                                "id": "uzbekistan",
                                "nombre": "Uzbekistán",
                                "sinonimos": ["la perla de la ruta de la seda"],
                                "latitud": 41.3775,
                                "longitud": 64.5853,
                                "bandera": "🇺🇿",
                                "descripcionGeneral": "El corazón de la antigua Ruta de la Seda, famoso por sus ciudades de cúpulas azules turquesa.",
                                "cultura": "Samarcanda es una de las ciudades habitadas más antiguas. Famosos por su hospitalidad y el pan plano.",
                                "datosCuriosos": ["Es uno de los dos únicos países 'doblemente sin litoral' del mundo (rodeado por países sin mar).", "Tienen minas de oro a cielo abierto masivas."],
                                "continent": "Asia",
                                "population": 33469203
                            },
                            {
                                "id": "turkmenistan",
                                "nombre": "Turkmenistán",
                                "sinonimos": ["corea del norte de asia central"],
                                "latitud": 38.9697,
                                "longitud": 59.5563,
                                "bandera": "🇹🇲",
                                "descripcionGeneral": "País desértico en gran parte, conocido por su capital de mármol blanco y ruinas antiguas.",
                                "cultura": "Famosos por los caballos Akhal-Teke (caballos dorados) y sus alfombras tradicionales.",
                                "datosCuriosos": ["Alberga la 'Puerta del Infierno' (cráter de gas Darvaza) que arde desde 1971.", "Su capital tiene el récord Guinness de más edificios de mármol blanco."],
                                "continent": "Asia",
                                "population": 6031187
                            },
                            {
                                "id": "kirguistan",
                                "nombre": "Kirguistán",
                                "sinonimos": ["la suiza de asia"],
                                "latitud": 41.2044,
                                "longitud": 74.7661,
                                "bandera": "🇰🇬",
                                "descripcionGeneral": "Nación definida por la cordillera Tian Shan, llena de pastores seminómadas y yurtas.",
                                "cultura": "El poema épico de Manas es el corazón de su identidad (más largo que la Odisea).",
                                "datosCuriosos": ["La bandera parece el logotipo de Xbox, pero representa el techo de una yurta y el sol.", "Todavía cazan usando águilas reales."],
                                "continent": "Asia",
                                "population": 6524191
                            },
                            {
                                "id": "tayikistan",
                                "nombre": "Tayikistán",
                                "sinonimos": ["el techo del mundo"],
                                "latitud": 38.8610,
                                "longitud": 71.2761,
                                "bandera": "🇹🇯",
                                "descripcionGeneral": "El país más pequeño de Asia Central, cubierto casi totalmente por las montañas Pamir.",
                                "cultura": "Tienen una fuerte influencia persa en su idioma y cultura, a diferencia de sus vecinos túrquicos.",
                                "datosCuriosos": ["Más del 90% del país es montañoso.", "Tienen la segunda presa más alta del mundo (Nurek)."],
                                "continent": "Asia",
                                "population": 9537645
                            },
                            {
                                "id": "afganistan",
                                "nombre": "Afganistán",
                                "sinonimos": ["cementerio de imperios"],
                                "latitud": 33.9391,
                                "longitud": 67.7100,
                                "bandera": "🇦🇫",
                                "descripcionGeneral": "País montañoso y sin salida al mar, históricamente un cruce de caminos entre Oriente y Occidente.",
                                "cultura": "Famosos por sus cometas, la poesía, las alfombras y la hospitalidad tribal.",
                                "datosCuriosos": ["El juego nacional es el Buzkashi (polo jugado con una cabra, sin cabeza).", "Se cree que el lapislázuli egipcio venía de minas afganas."],
                                "continent": "Asia",
                                "population": 38928346
                            },
                            {
                                "id": "mongolia",
                                "nombre": "Mongolia",
                                "sinonimos": ["tierra del cielo azul"],
                                "latitud": 46.8625,
                                "longitud": 103.8467,
                                "bandera": "🇲🇳",
                                "descripcionGeneral": "Nación vasta y escasamente poblada, conocida por sus estepas, el desierto de Gobi y la cultura nómada.",
                                "cultura": "Tierra de Genghis Khan. Muchos habitantes aún viven en gers (yurtas) y crían ganado.",
                                "datosCuriosos": ["Es el país con menor densidad de población del mundo.", "Hay más caballos que personas."],
                                "continent": "Asia",
                                "population": 3278290
                            },
                            {
                                    "id": "india",
                                    "nombre": "India",
                                    "sinonimos": ["bharat", "hindustán"],
                                    "latitud": 20.5937,
                                    "longitud": 78.9629,
                                    "bandera": "🇮🇳",
                                    "descripcionGeneral": "Vasto país que ocupa la mayor parte del subcontinente indio, famoso por su diversidad espiritual y caos vibrante.",
                                    "cultura": "Hogar del Yoga, Bollywood, el Taj Mahal y una gastronomía llena de especias.",
                                    "datosCuriosos": ["El ajedrez se inventó aquí.", "Es la democracia más grande del mundo y pronto será el país más poblado."],
                                    "continent": "Asia",
                                    "population": 1380004385
                                },
                                {
                                    "id": "pakistan",
                                    "nombre": "Pakistán",
                                    "sinonimos": ["tierra de los puros"],
                                    "latitud": 30.3753,
                                    "longitud": 69.3451,
                                    "bandera": "🇵🇰",
                                    "descripcionGeneral": "País que une el Medio Oriente con Asia, hogar del río Indo y picos altísimos como el K2.",
                                    "cultura": "Famosos por su música Sufí (Qawwali), el cricket y la hospitalidad hacia los viajeros.",
                                    "datosCuriosos": ["Fabrican más de la mitad de los balones de fútbol del mundo cosidos a mano.", "Tienen la carretera internacional pavimentada más alta del mundo (Karakórum)."],
                                    "continent": "Asia",
                                    "population": 220892331
                                },
                                {
                                    "id": "bangladesh",
                                    "nombre": "Bangladés",
                                    "sinonimos": ["bengala"],
                                    "latitud": 23.6850,
                                    "longitud": 90.3563,
                                    "bandera": "🇧🇩",
                                    "descripcionGeneral": "Nación en el delta del río Ganges, conocida por sus exuberantes paisajes verdes y vías fluviales.",
                                    "cultura": "Tierra del tigre de Bengala y de una industria textil masiva.",
                                    "datosCuriosos": ["Es uno de los países más densamente poblados del mundo.", "Tienen 6 estaciones en lugar de 4 (incluyendo la temporada del monzón)."],
                                    "continent": "Asia",
                                    "population": 164689383
                                },
                                {
                                    "id": "sri_lanka",
                                    "nombre": "Sri Lanka",
                                    "sinonimos": ["ceilán", "la lágrima de la india"],
                                    "latitud": 7.8731,
                                    "longitud": 80.7718,
                                    "bandera": "🇱🇰",
                                    "descripcionGeneral": "Isla en el Océano Índico con forma de lágrima, famosa por sus plantaciones de té y playas.",
                                    "cultura": "Conocida por el té de Ceilán, los elefantes salvajes y templos budistas antiguos.",
                                    "datosCuriosos": ["La canela es originaria de aquí.", "Tienen la mayor densidad de cascadas del mundo."],
                                    "continent": "Asia",
                                    "population": 21919000
                                },
                                {
                                    "id": "nepal",
                                    "nombre": "Nepal",
                                    "sinonimos": ["techo del mundo"],
                                    "latitud": 28.3949,
                                    "longitud": 84.1240,
                                    "bandera": "🇳🇵",
                                    "descripcionGeneral": "País sin salida al mar en el Himalaya, hogar del Monte Everest, el pico más alto de la Tierra.",
                                    "cultura": "Lugar de nacimiento de Buda (Siddhartha Gautama). Famosos por los sherpas y el alpinismo.",
                                    "datosCuriosos": ["Es el único país con una bandera que no es rectangular (son dos triángulos).", "Tienen a la única diosa viviente del mundo (Kumari)."],
                                    "continent": "Asia",
                                    "population": 29136808
                                },
                                {
                                    "id": "butan",
                                    "nombre": "Bután",
                                    "sinonimos": ["tierra del dragón del trueno"],
                                    "latitud": 27.5142,
                                    "longitud": 90.4336,
                                    "bandera": "🇧🇹",
                                    "descripcionGeneral": "Reino budista en el borde oriental del Himalaya, famoso por sus monasterios y fortalezas (dzongs).",
                                    "cultura": "Miden el éxito del país por la 'Felicidad Nacional Bruta' en lugar del dinero.",
                                    "datosCuriosos": ["Es el único país del mundo con carbono negativo (absorbe más CO2 del que emite).", "No hay semáforos en todo el país."],
                                    "continent": "Asia",
                                    "population": 771612
                                },
                                {
                                    "id": "maldivas",
                                    "nombre": "Maldivas",
                                    "sinonimos": ["islas maldivas"],
                                    "latitud": 3.2028,
                                    "longitud": 73.2207,
                                    "bandera": "🇲🇻",
                                    "descripcionGeneral": "Archipiélago tropical en el Océano Índico, famoso por sus atolones de coral y resorts de lujo.",
                                    "cultura": "Famosos por sus casas sobre el agua y una vida marina espectacular.",
                                    "datosCuriosos": ["Es el país más plano y bajo del mundo (promedio de 1.5 metros sobre el mar).", "El fin de semana es viernes y sábado."],
                                    "continent": "Asia",
                                    "population": 540542
                                },
                                {
                                        "id": "indonesia",
                                        "nombre": "Indonesia",
                                        "sinonimos": ["nusantara", "bali"],
                                        "latitud": -0.7893,
                                        "longitud": 113.9213,
                                        "bandera": "🇮🇩",
                                        "descripcionGeneral": "El archipiélago más grande del mundo, compuesto por miles de islas volcánicas, selvas y playas.",
                                        "cultura": "Hogar de la isla de los dioses (Bali), el gamelán y los dragones de Komodo.",
                                        "datosCuriosos": ["Tiene más de 17,000 islas.", "Es el país con más musulmanes del mundo."],
                                        "continent": "Asia",
                                        "population": 273523615
                                    },
                                    {
                                        "id": "tailandia",
                                        "nombre": "Tailandia",
                                        "sinonimos": ["siam", "tierra de las sonrisas"],
                                        "latitud": 15.8700,
                                        "longitud": 100.9925,
                                        "bandera": "🇹🇭",
                                        "descripcionGeneral": "Reino en el centro de la península de Indochina, famoso por sus templos dorados y playas tropicales.",
                                        "cultura": "Conocida por el Muay Thai, la comida callejera (Pad Thai) y el respeto al budismo.",
                                        "datosCuriosos": ["Es el único país del sudeste asiático que nunca fue colonizado por europeos.", "Bangkok tiene el nombre ceremonial más largo del mundo."],
                                        "continent": "Asia",
                                        "population": 69799978
                                    },
                                    {
                                        "id": "vietnam",
                                        "nombre": "Vietnam",
                                        "sinonimos": ["viet nam"],
                                        "latitud": 14.0583,
                                        "longitud": 108.2772,
                                        "bandera": "🇻🇳",
                                        "descripcionGeneral": "País costero conocido por sus bahías de piedra caliza, terrazas de arroz y ciudades vibrantes.",
                                        "cultura": "Famosos por el Pho (sopa), el café con huevo y su historia de resiliencia.",
                                        "datosCuriosos": ["Es el segundo mayor productor de café del mundo.", "La Bahía de Ha Long tiene miles de islas de piedra caliza."],
                                        "continent": "Asia",
                                        "population": 97338579
                                    },
                                    {
                                        "id": "filipinas",
                                        "nombre": "Filipinas",
                                        "sinonimos": ["las islas filipinas"],
                                        "latitud": 12.8797,
                                        "longitud": 121.7740,
                                        "bandera": "🇵🇭",
                                        "descripcionGeneral": "Archipiélago de más de 7,000 islas con una fuerte influencia hispana y estadounidense.",
                                        "cultura": "El único país predominantemente católico de Asia. Aman el baloncesto y el karaoke.",
                                        "datosCuriosos": ["Tienen una isla dentro de un lago, dentro de una isla... (Volcán Taal).", "Inventaron el yoyo como arma de caza."],
                                        "continent": "Asia",
                                        "population": 109581078
                                    },
                                    {
                                        "id": "malasia",
                                        "nombre": "Malasia",
                                        "sinonimos": ["malaysia"],
                                        "latitud": 4.2105,
                                        "longitud": 101.9758,
                                        "bandera": "🇲🇾",
                                        "descripcionGeneral": "Nación dividida en dos por el Mar de China Meridional, conocida por sus selvas y rascacielos.",
                                        "cultura": "Una mezcla multicultural de malayos, chinos e indios. Hogar de las Torres Petronas.",
                                        "datosCuriosos": ["Tienen la flor más grande del mundo (Rafflesia).", "Su sistema de monarquía es rotativo (el rey cambia cada 5 años)."],
                                        "continent": "Asia",
                                        "population": 32365999
                                    },
                                    {
                                        "id": "singapur",
                                        "nombre": "Singapur",
                                        "sinonimos": ["ciudad del león"],
                                        "latitud": 1.3521,
                                        "longitud": 103.8198,
                                        "bandera": "🇸🇬",
                                        "descripcionGeneral": "Moderna ciudad-estado insular, famosa por ser un centro financiero global y extremadamente limpia.",
                                        "cultura": "Fusión de culturas asiáticas. Conocida por sus jardines futuristas (Gardens by the Bay).",
                                        "datosCuriosos": ["Está prohibido importar o vender chicle.", "Es una de las pocas ciudades-estado que quedan en el mundo."],
                                        "continent": "Asia",
                                        "population": 5850342
                                    },
                                    {
                                        "id": "myanmar",
                                        "nombre": "Myanmar",
                                        "sinonimos": ["birmania", "burma"],
                                        "latitud": 21.9162,
                                        "longitud": 95.9560,
                                        "bandera": "🇲🇲",
                                        "descripcionGeneral": "País de templos dorados y paisajes vírgenes que se ha abierto al mundo recientemente.",
                                        "cultura": "Famoso por Bagan, una llanura con más de 2,000 templos antiguos.",
                                        "datosCuriosos": ["Los hombres usan faldas tradicionales llamadas Longyi.", "Tienen su propia unidad de medida y conducen por la derecha con volantes a la derecha."],
                                        "continent": "Asia",
                                        "population": 54409800
                                    },
                                    {
                                        "id": "camboya",
                                        "nombre": "Camboya",
                                        "sinonimos": ["reino de camboya"],
                                        "latitud": 12.5657,
                                        "longitud": 104.9910,
                                        "bandera": "🇰🇭",
                                        "descripcionGeneral": "Nación del sudeste asiático caracterizada por llanuras bajas, el delta del Mekong y montañas.",
                                        "cultura": "Hogar de Angkor Wat, el monumento religioso más grande del mundo.",
                                        "datosCuriosos": ["Su bandera es la única en el mundo que tiene un edificio (Angkor Wat).", "El Lago Tonlé Sap cambia la dirección de su flujo dos veces al año."],
                                        "continent": "Asia",
                                        "population": 16718965
                                    },
                                    {
                                        "id": "laos",
                                        "nombre": "Laos",
                                        "sinonimos": ["tierra del millón de elefantes"],
                                        "latitud": 19.8563,
                                        "longitud": 102.4955,
                                        "bandera": "🇱🇦",
                                        "descripcionGeneral": "País montañoso y sin salida al mar, conocido por su arquitectura colonial francesa y templos.",
                                        "cultura": "Famoso por sus monjes budistas y la ciudad patrimonio de Luang Prabang.",
                                        "datosCuriosos": ["Es el país más bombardeado per cápita de la historia (Guerra de Vietnam).", "El café es su mayor exportación agrícola."],
                                        "continent": "Asia",
                                        "population": 7275560
                                    },
                                    {
                                        "id": "brunei",
                                        "nombre": "Brunéi",
                                        "sinonimos": ["morada de la paz"],
                                        "latitud": 4.5353,
                                        "longitud": 114.7277,
                                        "bandera": "🇧🇳",
                                        "descripcionGeneral": "Pequeño sultanato rico en petróleo en la isla de Borneo, rodeado por Malasia.",
                                        "cultura": "Gobernado por un Sultán. Es conocido por sus mezquitas opulentas y selvas vírgenes.",
                                        "datosCuriosos": ["El Sultán tiene una de las colecciones de autos más grandes del mundo (miles).", "Los ciudadanos no pagan impuestos sobre la renta."],
                                        "continent": "Asia",
                                        "population": 437479
                                    },
                                    {
                                        "id": "timor_oriental",
                                        "nombre": "Timor Oriental",
                                        "sinonimos": ["timor-leste"],
                                        "latitud": -8.8742,
                                        "longitud": 125.7275,
                                        "bandera": "🇹🇱",
                                        "descripcionGeneral": "Una de las naciones más jóvenes del mundo, ocupa la mitad de la isla de Timor.",
                                        "cultura": "Mezcla de tradiciones indígenas, catolicismo y herencia portuguesa.",
                                        "datosCuriosos": ["Es el único país de Asia (junto con Filipinas) mayoritariamente católico.", "Su nombre significa 'Este Este' (Timor viene de Timur, que es este en malayo)."],
                                        "continent": "Asia",
                                        "population": 1318445
                                    },
                                    {
                                            "id": "china",
                                            "nombre": "China",
                                            "sinonimos": ["república popular china", "el gigante asiático"],
                                            "latitud": 35.8617,
                                            "longitud": 104.1954,
                                            "bandera": "🇨🇳",
                                            "descripcionGeneral": "La nación más poblada de Asia y una de las civilizaciones más antiguas de la historia.",
                                            "cultura": "Famosa por la Gran Muralla, el té, las artes marciales y el Año Nuevo Lunar.",
                                            "datosCuriosos": ["Inventaron el papel, la brújula, la pólvora y la imprenta.", "Todos los osos panda del mundo pertenecen a China."],
                                            "continent": "Asia",
                                            "population": 1439323776
                                        },
                                        {
                                            "id": "japon",
                                            "nombre": "Japón",
                                            "sinonimos": ["nipón", "país del sol naciente"],
                                            "latitud": 36.2048,
                                            "longitud": 138.2529,
                                            "bandera": "🇯🇵",
                                            "descripcionGeneral": "Archipiélago donde la tradición milenaria convive con la tecnología futurista.",
                                            "cultura": "Mundialmente amado por el anime, los videojuegos, el sushi y los samuráis.",
                                            "datosCuriosos": ["Cultivan sandías cuadradas para guardarlas mejor.", "Tienen máquinas expendedoras de casi cualquier cosa."],
                                            "continent": "Asia",
                                            "population": 126476461
                                        },
                                        {
                                            "id": "corea_del_sur",
                                            "nombre": "Corea del Sur",
                                            "sinonimos": ["corea", "tierra de la calma matutina"],
                                            "latitud": 35.9078,
                                            "longitud": 127.7669,
                                            "bandera": "🇰🇷",
                                            "descripcionGeneral": "Nación líder en tecnología y cultura pop, ubicada en la mitad sur de la península coreana.",
                                            "cultura": "El hogar del K-Pop (BTS), los K-Dramas, el kimchi y los e-sports.",
                                            "datosCuriosos": ["Tienen el internet más rápido del mundo.", "Es común preguntar el tipo de sangre para saber la personalidad."],
                                            "continent": "Asia",
                                            "population": 51269185
                                        },
                                        {
                                            "id": "corea_del_norte",
                                            "nombre": "Corea del Norte",
                                            "sinonimos": ["rpdc"],
                                            "latitud": 40.3399,
                                            "longitud": 127.5101,
                                            "bandera": "🇰🇵",
                                            "descripcionGeneral": "País hermético en la mitad norte de la península, conocido por su aislamiento político.",
                                            "cultura": "Se caracteriza por los espectáculos masivos de gimnasia (Arirang) y el culto a los líderes.",
                                            "datosCuriosos": ["Tienen su propio calendario que empieza en el año de nacimiento de su fundador (1912).", "Tienen el estadio más grande del mundo (Rungrado Primero de Mayo)."],
                                            "continent": "Asia",
                                            "population": 25778816
                                        },
                                        {
                                            "id": "taiwan",
                                            "nombre": "Taiwán",
                                            "sinonimos": ["isla hermosa"],
                                            "latitud": 23.6978,
                                            "longitud": 120.9605,
                                            "bandera": "🇹🇼",
                                            "descripcionGeneral": "Isla de alta tecnología con paisajes montañosos y ciudades vibrantes.",
                                            "cultura": "Famosos por sus mercados nocturnos y por inventar el Bubble Tea (té de burbujas).",
                                            "datosCuriosos": ["El rascacielos Taipei 101 tiene una bola gigante de acero para resistir terremotos.", "Los camiones de basura tocan música clásica (como Für Elise)."],
                                            "continent": "Asia",
                                            "population": 23816775
                                        },
                                        {
                                                "id": "palestina",
                                                "nombre": "Palestina",
                                                "sinonimos": ["estado de palestina"],
                                                "latitud": 31.9522,
                                                "longitud": 35.2332,
                                                "bandera": "🇵🇸",
                                                "descripcionGeneral": "Estado en el Mediterráneo oriental, hogar de lugares sagrados para tres religiones monoteístas.",
                                                "cultura": "Famosa por sus olivos milenarios, el bordado tradicional (Tatreez) y la danza Dabke.",
                                                "datosCuriosos": ["La ciudad de Jericó es considerada una de las ciudades habitadas más antiguas del mundo.", "El Mar Muerto es compartido con Israel y Jordania."],
                                                "continent": "Asia",
                                                "population": 5101414
                                            },
                                            {
                                                "id": "australia",
                                                "nombre": "Australia",
                                                "sinonimos": ["oz", "tierra de abajo"],
                                                "latitud": -25.2744,
                                                "longitud": 133.7751,
                                                "bandera": "🇦🇺",
                                                "descripcionGeneral": "El país más grande de Oceanía, famoso por su interior desértico (Outback) y la Gran Barrera de Coral.",
                                                "cultura": "Conocidos por el surf, las barbacoas (BBQ) y su fauna única.",
                                                "datosCuriosos": ["Hay más canguros que humanos.", "Tienen una montaña llamada Monte Decepción."],
                                                "continent": "Oceanía",
                                                "population": 25499884
                                            },
                                            {
                                                "id": "nueva_zelanda",
                                                "nombre": "Nueva Zelanda",
                                                "sinonimos": ["aotearoa", "tierra media"],
                                                "latitud": -40.9006,
                                                "longitud": 174.8860,
                                                "bandera": "🇳🇿",
                                                "descripcionGeneral": "Nación insular famosa por sus paisajes dramáticos de montañas, fiordos y volcanes.",
                                                "cultura": "Fuerte herencia Maorí (el Haka) y pasión absoluta por el rugby.",
                                                "datosCuriosos": ["Fue el primer país en dar el voto a las mujeres.", "No hay serpientes terrestres nativas."],
                                                "continent": "Oceanía",
                                                "population": 4822233
                                            },
                                            {
                                                "id": "papua_nueva_guinea",
                                                "nombre": "Papúa Nueva Guinea",
                                                "sinonimos": ["png"],
                                                "latitud": -6.3150,
                                                "longitud": 143.9555,
                                                "bandera": "🇵🇬",
                                                "descripcionGeneral": "Ocupa la mitad oriental de la isla de Nueva Guinea, conocida por su inmensa diversidad cultural y biológica.",
                                                "cultura": "Hogar de cientos de tribus indígenas, muchas en zonas remotas.",
                                                "datosCuriosos": ["Es el país con mayor diversidad lingüística del mundo (más de 800 idiomas).", "Tienen aves venenosas (el Pitohui)."],
                                                "continent": "Oceanía",
                                                "population": 8947027
                                            },
                                            {
                                                "id": "fiji",
                                                "nombre": "Fiyi",
                                                "sinonimos": ["islas fiji"],
                                                "latitud": -17.7134,
                                                "longitud": 178.0650,
                                                "bandera": "🇫🇯",
                                                "descripcionGeneral": "Archipiélago de más de 300 islas en el Pacífico Sur, famoso por sus paisajes de postal.",
                                                "cultura": "Conocidos por su amabilidad (espíritu Bula), el rugby a siete y la bebida Kava.",
                                                "datosCuriosos": ["La tradición de caminar sobre fuego se originó aquí.", "El huso horario permite estar 'entre hoy y ayer'."],
                                                "continent": "Oceanía",
                                                "population": 896444
                                            },
                                            {
                                                "id": "islas_salomon",
                                                "nombre": "Islas Salomón",
                                                "sinonimos": ["solomons"],
                                                "latitud": -9.6457,
                                                "longitud": 160.1562,
                                                "bandera": "🇸🇧",
                                                "descripcionGeneral": "Nación de cientos de islas al este de Papúa Nueva Guinea, rica en historia de la Segunda Guerra Mundial.",
                                                "cultura": "Cultura melanesia tradicional y buceo de clase mundial en naufragios.",
                                                "datosCuriosos": ["JFK (presidente de EE.UU.) naufragó aquí y fue rescatado por locales.", "Parte de la población tiene cabello rubio natural por un gen único."],
                                                "continent": "Oceanía",
                                                "population": 686878
                                            },
                                            {
                                                "id": "vanuatu",
                                                "nombre": "Vanuatu",
                                                "sinonimos": ["república de vanuatu"],
                                                "latitud": -15.3767,
                                                "longitud": 166.9592,
                                                "bandera": "🇻🇺",
                                                "descripcionGeneral": "Cadena de islas volcánicas en el Pacífico Sur, con volcanes activos muy accesibles.",
                                                "cultura": "Famosos por el 'Land Diving' (salto desde torres de madera), precursor del bungee.",
                                                "datosCuriosos": ["Inventaron el concepto del salto bungee.", "El Monte Yasur es uno de los volcanes activos más accesibles del mundo."],
                                                "continent": "Oceanía",
                                                "population": 307150
                                            },
                                            {
                                                "id": "samoa",
                                                "nombre": "Samoa",
                                                "sinonimos": ["samoa occidental"],
                                                "latitud": -13.7590,
                                                "longitud": -172.1046,
                                                "bandera": "🇼🇸",
                                                "descripcionGeneral": "El corazón de la Polinesia, islas tropicales con cascadas y playas vírgenes.",
                                                "cultura": "Se rigen por el 'Fa'a Samoa' (el estilo de vida samoano). Famosos por sus tatuajes tradicionales.",
                                                "datosCuriosos": ["En 2011 se saltaron un día completo (el 30 de diciembre) para cambiar de huso horario.", "Robert Louis Stevenson (La Isla del Tesoro) vivió y murió aquí."],
                                                "continent": "Oceanía",
                                                "population": 198410
                                            },
                                            {
                                                "id": "kiribati",
                                                "nombre": "Kiribati",
                                                "sinonimos": ["islas gilbert"],
                                                "latitud": -3.3704,
                                                "longitud": -168.7340,
                                                "bandera": "🇰🇮",
                                                "descripcionGeneral": "Nación de atolones dispersos a lo largo del ecuador, en riesgo por el cambio climático.",
                                                "cultura": "Excelentes pescadores y constructores de canoas.",
                                                "datosCuriosos": ["Es el único país situado en los cuatro hemisferios del mundo.", "Es el primer país en recibir el Año Nuevo cada año."],
                                                "continent": "Oceanía",
                                                "population": 119446
                                            },
                                            {
                                                "id": "tonga",
                                                "nombre": "Tonga",
                                                "sinonimos": ["las islas amistosas"],
                                                "latitud": -21.1790,
                                                "longitud": -175.1982,
                                                "bandera": "🇹🇴",
                                                "descripcionGeneral": "Reino polinesio de más de 170 islas, muchas deshabitadas.",
                                                "cultura": "Es la única monarquía del Pacífico. El domingo es estrictamente para descansar por ley.",
                                                "datosCuriosos": ["Nunca perdió completamente su soberanía ante una potencia colonial.", "El Rey es una figura muy respetada y poderosa."],
                                                "continent": "Oceanía",
                                                "population": 105697
                                            },
                                            {
                                                "id": "micronesia",
                                                "nombre": "Micronesia",
                                                "sinonimos": ["estados federados de micronesia"],
                                                "latitud": 7.4256,
                                                "longitud": 150.5508,
                                                "bandera": "🇫🇲",
                                                "descripcionGeneral": "País compuesto por cuatro estados insulares dispersos en el Pacífico occidental.",
                                                "cultura": "En la isla de Yap, utilizan discos de piedra gigantes como moneda tradicional.",
                                                "datosCuriosos": ["Tienen el dinero más pesado del mundo (piedras Rai).", "Nan Madol es una antigua ciudad de piedra construida sobre arrecifes de coral."],
                                                "continent": "Oceanía",
                                                "population": 115021
                                            },
                                            {
                                                "id": "palau",
                                                "nombre": "Palaos",
                                                "sinonimos": ["palau"],
                                                "latitud": 7.5150,
                                                "longitud": 134.5825,
                                                "bandera": "🇵🇼",
                                                "descripcionGeneral": "Archipiélago de cientos de islas de piedra caliza y coral, paraíso del buceo.",
                                                "cultura": "Sociedad tradicionalmente matrilineal (las mujeres heredan y deciden).",
                                                "datosCuriosos": ["Tienen un lago lleno de millones de medusas que no pican.", "Crearon el primer santuario de tiburones del mundo."],
                                                "continent": "Oceanía",
                                                "population": 18092
                                            },
                                            {
                                                "id": "islas_marshall",
                                                "nombre": "Islas Marshall",
                                                "sinonimos": ["marshall islands"],
                                                "latitud": 7.1315,
                                                "longitud": 171.1845,
                                                "bandera": "🇲🇭",
                                                "descripcionGeneral": "Cadenas de atolones y arrecifes de coral entre Hawái y Australia.",
                                                "cultura": "Expertos navegantes que usaban cartas de palos para leer las olas.",
                                                "datosCuriosos": ["El Bikini (traje de baño) se nombró por el Atolón Bikini de aquí (donde hubo pruebas nucleares).", "Bob Esponja 'vive' en el fondo del Atolón Bikini."],
                                                "continent": "Oceanía",
                                                "population": 59190
                                            },
                                            {
                                                "id": "nauru",
                                                "nombre": "Nauru",
                                                "sinonimos": ["isla agradable"],
                                                "latitud": -0.5228,
                                                "longitud": 166.9315,
                                                "bandera": "🇳🇷",
                                                "descripcionGeneral": "Pequeña isla de fosfato al noreste de Australia.",
                                                "cultura": "El fútbol australiano es el deporte nacional.",
                                                "datosCuriosos": ["Es el país insular más pequeño del mundo.", "No tiene capital oficial."],
                                                "continent": "Oceanía",
                                                "population": 10834
                                            },
                                            {
                                                "id": "tuvalu",
                                                "nombre": "Tuvalu",
                                                "sinonimos": ["islas ellice"],
                                                "latitud": -7.1095,
                                                "longitud": 177.6493,
                                                "bandera": "🇹🇻",
                                                "descripcionGeneral": "Nueve atolones delgados en el Pacífico Sur.",
                                                "cultura": "Famosos por la danza y música Fatele.",
                                                "datosCuriosos": ["Gran parte de sus ingresos proviene de vender su dominio de internet '.tv'.", "Es uno de los países menos visitados del mundo."],
                                                "continent": "Oceanía",
                                                "population": 11792
                                            },
                                            {
                                                    "id": "egipto",
                                                    "nombre": "Egipto",
                                                    "sinonimos": ["tierra de los faraones"],
                                                    "latitud": 26.8206,
                                                    "longitud": 30.8025,
                                                    "bandera": "🇪🇬",
                                                    "descripcionGeneral": "Nación transcontinental que une el noreste de África con Medio Oriente, famosa por su civilización milenaria.",
                                                    "cultura": "Mundialmente conocido por las Pirámides de Giza, el río Nilo y los jeroglíficos.",
                                                    "datosCuriosos": ["El calendario de 365 días se inventó aquí.", "Tienen la única maravilla del mundo antiguo que sigue en pie (La Gran Pirámide)."],
                                                    "continent": "África",
                                                    "population": 102334404
                                                },
                                                {
                                                    "id": "marruecos",
                                                    "nombre": "Marruecos",
                                                    "sinonimos": ["reino de marruecos"],
                                                    "latitud": 31.7917,
                                                    "longitud": -7.0926,
                                                    "bandera": "🇲🇦",
                                                    "descripcionGeneral": "País del norte de África que bordea el Atlántico y el Mediterráneo, puerta al Sahara.",
                                                    "cultura": "Famoso por sus zocos (mercados), el té de menta, las especias y la arquitectura morisca.",
                                                    "datosCuriosos": ["La universidad más antigua del mundo en funcionamiento está en Fez (Al-Qarawiyyin).", "El color azul de la ciudad de Chefchaouen repele a los mosquitos."],
                                                    "continent": "África",
                                                    "population": 36910560
                                                },
                                                {
                                                    "id": "argelia",
                                                    "nombre": "Argelia",
                                                    "sinonimos": ["algeria"],
                                                    "latitud": 28.0339,
                                                    "longitud": 1.6596,
                                                    "bandera": "🇩🇿",
                                                    "descripcionGeneral": "El país más grande de África, dominado por el desierto del Sahara y ruinas romanas.",
                                                    "cultura": "Mezcla de influencias bereberes, árabes y francesas. Famoso por la música Raï.",
                                                    "datosCuriosos": ["El desierto del Sahara cubre más del 80% del país.", "Es el país más grande del continente africano y del mundo árabe."],
                                                    "continent": "África",
                                                    "population": 43851044
                                                },
                                                {
                                                    "id": "tunez",
                                                    "nombre": "Túnez",
                                                    "sinonimos": ["tunisia"],
                                                    "latitud": 33.8869,
                                                    "longitud": 9.5375,
                                                    "bandera": "🇹🇳",
                                                    "descripcionGeneral": "País norteafricano con playas mediterráneas y antiguas ruinas cartaginesas.",
                                                    "cultura": "Famoso por sus puertas azules y blancas (Sidi Bou Said) y mosaicos antiguos.",
                                                    "datosCuriosos": ["Muchas escenas de Star Wars (Tatooine) se filmaron aquí.", "Fue el hogar de la antigua Cartago, rival de Roma."],
                                                    "continent": "África",
                                                    "population": 11818619
                                                },
                                                {
                                                    "id": "libia",
                                                    "nombre": "Libia",
                                                    "sinonimos": ["libya"],
                                                    "latitud": 26.3351,
                                                    "longitud": 17.2283,
                                                    "bandera": "🇱🇾",
                                                    "descripcionGeneral": "Nación rica en petróleo con una costa mediterránea larga y un vasto interior desértico.",
                                                    "cultura": "Alberga Leptis Magna, una de las ciudades romanas mejor conservadas del mundo.",
                                                    "datosCuriosos": ["El 90% del país es desierto.", "Tuvo la única bandera de un solo color (verde) del mundo hasta 2011."],
                                                    "continent": "África",
                                                    "population": 6871292
                                                },
                                                {
                                                    "id": "sudan",
                                                    "nombre": "Sudán",
                                                    "sinonimos": ["tierra de los negros"],
                                                    "latitud": 12.8628,
                                                    "longitud": 30.2176,
                                                    "bandera": "🇸🇩",
                                                    "descripcionGeneral": "País en el noreste de África donde se encuentran el Nilo Blanco y el Nilo Azul.",
                                                    "cultura": "Hogar de la antigua civilización nubia y sus faraones negros.",
                                                    "datosCuriosos": ["Tiene más pirámides que Egipto (más de 200).", "Jartum, la capital, está justo donde se unen los dos ríos Nilo."],
                                                    "continent": "África",
                                                    "population": 43849260
                                                },
                                                {
                                                    "id": "nigeria",
                                                    "nombre": "Nigeria",
                                                    "sinonimos": ["gigante de áfrica"],
                                                    "latitud": 9.0820,
                                                    "longitud": 8.6753,
                                                    "bandera": "🇳🇬",
                                                    "descripcionGeneral": "Potencia económica y el país más poblado de África, ubicado en el Golfo de Guinea.",
                                                    "cultura": "Hogar de Nollywood (segunda industria cinematográfica más grande) y la música Afrobeats.",
                                                    "datosCuriosos": ["Tiene la mayor diversidad de mariposas del mundo.", "Uno de cada cinco africanos es nigeriano."],
                                                    "continent": "África",
                                                    "population": 206139589
                                                },
                                                {
                                                    "id": "ghana",
                                                    "nombre": "Ghana",
                                                    "sinonimos": ["costa de oro"],
                                                    "latitud": 7.9465,
                                                    "longitud": -1.0232,
                                                    "bandera": "🇬🇭",
                                                    "descripcionGeneral": "Nación de África Occidental conocida por su estabilidad, playas y fuertes coloniales.",
                                                    "cultura": "Famosos por la tela Kente colorida y por ser el primer país africano subsahariano en independizarse.",
                                                    "datosCuriosos": ["El lago Volta es el lago artificial más grande del mundo por superficie.", "Es el segundo mayor productor de cacao del mundo."],
                                                    "continent": "África",
                                                    "population": 31072940
                                                },
                                                {
                                                    "id": "senegal",
                                                    "nombre": "Senegal",
                                                    "sinonimos": ["puerta de áfrica"],
                                                    "latitud": 14.4974,
                                                    "longitud": -14.4524,
                                                    "bandera": "🇸🇳",
                                                    "descripcionGeneral": "País en la punta más occidental de África, conocido por su hospitalidad (Teranga).",
                                                    "cultura": "Famoso por el Rally Dakar (originalmente) y su música mbalax.",
                                                    "datosCuriosos": ["Tiene un lago rosa natural (Lago Retba) debido a las algas y la sal.", "La Isla de Gorea fue un centro histórico del comercio de esclavos."],
                                                    "continent": "África",
                                                    "population": 16743927
                                                },
                                                {
                                                    "id": "costa_de_marfil",
                                                    "nombre": "Costa de Marfil",
                                                    "sinonimos": ["côte d'ivoire"],
                                                    "latitud": 7.5400,
                                                    "longitud": -5.5471,
                                                    "bandera": "🇨🇮",
                                                    "descripcionGeneral": "País de África Occidental con resorts de playa y selvas tropicales.",
                                                    "cultura": "Líder mundial en producción de cacao. Famosos por su música Zouglou y el fútbol.",
                                                    "datosCuriosos": ["Tienen la iglesia más grande del mundo (Basílica de Nuestra Señora de la Paz).", "Producen más del 30% del cacao del mundo."],
                                                    "continent": "África",
                                                    "population": 26378274
                                                },
                                                {
                                                    "id": "mali",
                                                    "nombre": "Malí",
                                                    "sinonimos": ["imperio de malí"],
                                                    "latitud": 17.5707,
                                                    "longitud": -3.9962,
                                                    "bandera": "🇲🇱",
                                                    "descripcionGeneral": "Nación sin litoral en el Sahel, cuna de grandes imperios antiguos y bibliotecas.",
                                                    "cultura": "Hogar de la legendaria ciudad de Tombuctú y la Gran Mezquita de Djenné (hecha de barro).",
                                                    "datosCuriosos": ["Mansa Musa, un emperador de Malí, es considerado la persona más rica de la historia.", "Tienen un festival de música en el desierto."],
                                                    "continent": "África",
                                                    "population": 20250833
                                                },
                                                {
                                                    "id": "camerun",
                                                    "nombre": "Camerún",
                                                    "sinonimos": ["áfrica en miniatura"],
                                                    "latitud": 7.3697,
                                                    "longitud": 12.3547,
                                                    "bandera": "🇨🇲",
                                                    "descripcionGeneral": "País en el Golfo de Guinea con terreno diverso: playas, desiertos, montañas y selvas.",
                                                    "cultura": "Conocidos por el fútbol (Leones Indomables) y sus estilos musicales locales (Makossa).",
                                                    "datosCuriosos": ["Se le llama 'África en miniatura' porque tiene todos los climas del continente.", "Es el hogar de la rana más grande del mundo (Rana Goliat)."],
                                                    "continent": "África",
                                                    "population": 26545863
                                                },
                                                {
                                                    "id": "cabo_verde",
                                                    "nombre": "Cabo Verde",
                                                    "sinonimos": ["cabo verde"],
                                                    "latitud": 16.5388,
                                                    "longitud": -23.0418,
                                                    "bandera": "🇨🇻",
                                                    "descripcionGeneral": "Archipiélago volcánico frente a la costa noroeste de África.",
                                                    "cultura": "Famoso por la música Morna (Cesária Évora) y su cultura criolla portuguesa-africana.",
                                                    "datosCuriosos": ["Hay más caboverdianos viviendo fuera del país que dentro.", "Fue el primer asentamiento europeo en los trópicos."],
                                                    "continent": "África",
                                                    "population": 555987
                                                },
                                            {
                                                        "id": "etiopia",
                                                        "nombre": "Etiopía",
                                                        "sinonimos": ["abisina", "cuerno de áfrica"],
                                                        "latitud": 9.1450,
                                                        "longitud": 40.4897,
                                                        "bandera": "🇪🇹",
                                                        "descripcionGeneral": "Nación en el Cuerno de África con una historia antigua y paisajes de tierras altas.",
                                                        "cultura": "Es el único país africano que nunca fue colonizado formalmente. Origen del café.",
                                                        "datosCuriosos": ["Tienen su propio calendario (están 7 años atrás del nuestro).", "Se dice que el Arca de la Alianza está escondida aquí."],
                                                        "continent": "África",
                                                        "population": 114963588
                                                    },
                                                    {
                                                        "id": "kenia",
                                                        "nombre": "Kenia",
                                                        "sinonimos": ["kenya"],
                                                        "latitud": -1.2921,
                                                        "longitud": 36.8219,
                                                        "bandera": "🇰🇪",
                                                        "descripcionGeneral": "El corazón de los safaris en África Oriental, hogar de la sabana del Masái Mara.",
                                                        "cultura": "Famosa por los guerreros Masái y por producir a los mejores corredores de maratón del mundo.",
                                                        "datosCuriosos": ["Aquí ocurre la 'Gran Migración' de ñus cada año.", "Es considerada una de las cunas de la humanidad (fósiles antiguos)."],
                                                        "continent": "África",
                                                        "population": 53771300
                                                    },
                                                    {
                                                        "id": "tanzania",
                                                        "nombre": "Tanzania",
                                                        "sinonimos": ["tierra del kilimanjaro"],
                                                        "latitud": -6.3690,
                                                        "longitud": 34.8888,
                                                        "bandera": "🇹🇿",
                                                        "descripcionGeneral": "País de África Oriental conocido por sus vastas zonas silvestres.",
                                                        "cultura": "Hogar del Monte Kilimanjaro (el pico más alto de África) y la isla de las especias, Zanzíbar.",
                                                        "datosCuriosos": ["El 30% del país es parque nacional.", "El león de 'El Rey León' está inspirado en los leones del Serengeti de aquí."],
                                                        "continent": "África",
                                                        "population": 59734218
                                                    },
                                                    {
                                                        "id": "uganda",
                                                        "nombre": "Uganda",
                                                        "sinonimos": ["la perla de áfrica"],
                                                        "latitud": 1.3733,
                                                        "longitud": 32.2903,
                                                        "bandera": "🇺🇬",
                                                        "descripcionGeneral": "País sin litoral con paisajes diversos, desde las montañas Rwenzori hasta el Lago Victoria.",
                                                        "cultura": "Famoso por ser uno de los últimos refugios de los gorilas de montaña en libertad.",
                                                        "datosCuriosos": ["Tiene una de las poblaciones más jóvenes del mundo.", "Comen saltamontes fritos como aperitivo (Nsenene)."],
                                                        "continent": "África",
                                                        "population": 45741007
                                                    },
                                                    {
                                                        "id": "ruanda",
                                                        "nombre": "Ruanda",
                                                        "sinonimos": ["tierra de las mil colinas"],
                                                        "latitud": -1.9403,
                                                        "longitud": 29.8739,
                                                        "bandera": "🇷🇼",
                                                        "descripcionGeneral": "Pequeña nación montañosa conocida por su recuperación milagrosa y limpieza.",
                                                        "cultura": "Líder mundial en conservación de gorilas y en representación femenina en el gobierno.",
                                                        "datosCuriosos": ["Las bolsas de plástico están prohibidas y te las confiscan en el aeropuerto.", "El último sábado de cada mes, todos los ciudadanos hacen servicio comunitario obligatorio."],
                                                        "continent": "África",
                                                        "population": 12952218
                                                    },
                                                    {
                                                        "id": "congo_rd",
                                                        "nombre": "R.D. del Congo",
                                                        "sinonimos": ["rdc", "congo kinshasa"],
                                                        "latitud": -4.0383,
                                                        "longitud": 21.7587,
                                                        "bandera": "🇨🇩",
                                                        "descripcionGeneral": "El segundo país más grande de África, cubierto por una inmensa selva tropical.",
                                                        "cultura": "Cuna de la música Rumba Congoleña y rica en recursos naturales.",
                                                        "datosCuriosos": ["Es el país más rico del mundo en recursos naturales (y uno de los más pobres económicamente).", "Hogar del bonobo, el primate más cercano al humano."],
                                                        "continent": "África",
                                                        "population": 89561403
                                                    },
                                                    {
                                                        "id": "angola",
                                                        "nombre": "Angola",
                                                        "sinonimos": ["república de angola"],
                                                        "latitud": -11.2027,
                                                        "longitud": 17.8739,
                                                        "bandera": "🇦🇴",
                                                        "descripcionGeneral": "Nación del sur de África con vastos recursos petroleros y herencia portuguesa.",
                                                        "cultura": "Origen del baile Kizomba y de las raíces de la Capoeira brasileña.",
                                                        "datosCuriosos": ["Su capital, Luanda, es frecuentemente la ciudad más cara del mundo para expatriados.", "Tienen un antílope gigante (Palanca Negra) que es símbolo nacional."],
                                                        "continent": "África",
                                                        "population": 32866272
                                                    },
                                                    {
                                                        "id": "namibia",
                                                        "nombre": "Namibia",
                                                        "sinonimos": ["tierra de los valientes"],
                                                        "latitud": -22.9576,
                                                        "longitud": 18.4904,
                                                        "bandera": "🇳🇦",
                                                        "descripcionGeneral": "País desértico en el suroeste de África, famoso por sus dunas rojas gigantes.",
                                                        "cultura": "Hogar del desierto del Namib (el más antiguo del mundo) y la Costa de los Esqueletos.",
                                                        "datosCuriosos": ["El desierto se encuentra directamente con el océano Atlántico.", "Fue el primer país en incluir la protección ambiental en su constitución."],
                                                        "continent": "África",
                                                        "population": 2540905
                                                    },
                                                    {
                                                        "id": "botsuana",
                                                        "nombre": "Botsuana",
                                                        "sinonimos": ["botswana"],
                                                        "latitud": -22.3285,
                                                        "longitud": 24.6849,
                                                        "bandera": "🇧🇼",
                                                        "descripcionGeneral": "País sin litoral definido por el desierto de Kalahari y el Delta del Okavango.",
                                                        "cultura": "Uno de los países más estables y prósperos de África. Refugio de elefantes.",
                                                        "datosCuriosos": ["Tiene la mayor población de elefantes del mundo.", "El Delta del Okavango es un río que nunca llega al mar (se evapora en el desierto)."],
                                                        "continent": "África",
                                                        "population": 2351627
                                                    },
                                                    {
                                                        "id": "zimbabue",
                                                        "nombre": "Zimbabue",
                                                        "sinonimos": ["zimbabwe"],
                                                        "latitud": -19.0154,
                                                        "longitud": 29.1549,
                                                        "bandera": "🇿🇼",
                                                        "descripcionGeneral": "País sin salida al mar conocido por sus espectaculares paisajes y fauna.",
                                                        "cultura": "Hogar de las Cataratas Victoria (una de las maravillas naturales del mundo).",
                                                        "datosCuriosos": ["Tienen una de las tasas de alfabetización más altas de África.", "Su moneda tuvo billetes de 100 billones de dólares debido a la inflación."],
                                                        "continent": "África",
                                                        "population": 14862924
                                                    },
                                                    {
                                                        "id": "sudafrica",
                                                        "nombre": "Sudáfrica",
                                                        "sinonimos": ["la nación del arcoíris"],
                                                        "latitud": -30.5595,
                                                        "longitud": 22.9375,
                                                        "bandera": "🇿🇦",
                                                        "descripcionGeneral": "País en el extremo sur de África, famoso por su historia y ecosistemas variados.",
                                                        "cultura": "Hogar de Nelson Mandela y la lucha contra el Apartheid. Famoso por el Rugby.",
                                                        "datosCuriosos": ["Tiene 3 capitales oficiales (Pretoria, Ciudad del Cabo, Bloemfontein).", "Ha albergado mundiales de Fútbol, Rugby y Cricket."],
                                                        "continent": "África",
                                                        "population": 59308690
                                                    },
                                                    {
                                                        "id": "mozambique",
                                                        "nombre": "Mozambique",
                                                        "sinonimos": ["la perla del índico"],
                                                        "latitud": -18.6657,
                                                        "longitud": 35.5296,
                                                        "bandera": "🇲🇿",
                                                        "descripcionGeneral": "Nación costera en el sureste de África, famosa por sus playas y mariscos.",
                                                        "cultura": "Mezcla de herencia africana, árabe y portuguesa. Famosos por la música Marrabenta.",
                                                        "datosCuriosos": ["Es el único país con un arma moderna (AK-47) en su bandera.", "Su nombre proviene de un comerciante árabe llamado Mussa Bin Bique."],
                                                        "continent": "África",
                                                        "population": 31255435
                                                    },
                                                    {
                                                        "id": "madagascar",
                                                        "nombre": "Madagascar",
                                                        "sinonimos": ["la gran isla roja"],
                                                        "latitud": -18.7669,
                                                        "longitud": 46.8691,
                                                        "bandera": "🇲🇬",
                                                        "descripcionGeneral": "Enorme isla frente a la costa sureste de África, un mundo biológico aparte.",
                                                        "cultura": "El 90% de su flora y fauna no existe en ningún otro lugar (como los lémures).",
                                                        "datosCuriosos": ["Es la cuarta isla más grande del mundo.", "Tienen árboles Baobab que parecen plantados al revés (con las raíces al aire)."],
                                                        "continent": "África",
                                                        "population": 27691018
                                                    },
                                                    {
                                                        "id": "mauricio",
                                                        "nombre": "Mauricio",
                                                        "sinonimos": ["isla mauricio"],
                                                        "latitud": -20.3484,
                                                        "longitud": 57.5522,
                                                        "bandera": "🇲🇺",
                                                        "descripcionGeneral": "Nación insular en el Océano Índico, conocida por sus playas, lagunas y arrecifes.",
                                                        "cultura": "Fue el único hogar conocido del pájaro Dodo (ya extinto).",
                                                        "datosCuriosos": ["Mark Twain dijo: 'Primero se hizo Mauricio, y luego el cielo'.", "Tienen una 'Tierra de los Siete Colores' (dunas de arena multicolor)."],
                                                        "continent": "África",
                                                        "population": 1265740
                                                    },
                                                    {
                                                        "id": "seychelles",
                                                        "nombre": "Seychelles",
                                                        "sinonimos": ["islas seychelles"],
                                                        "latitud": -4.6796,
                                                        "longitud": 55.4920,
                                                        "bandera": "🇸🇨",
                                                        "descripcionGeneral": "Archipiélago de 115 islas en el Océano Índico, un paraíso tropical.",
                                                        "cultura": "Sociedad matriarcal y líder en conservación marina.",
                                                        "datosCuriosos": ["Tienen las tortugas gigantes de Aldabra (que viven hasta 150 años).", "Albergan el 'Coco de Mer', la semilla más grande y pesada del reino vegetal."],
                                                        "continent": "África",
                                                        "population": 98462
                                                    },
                                                    
                                                    {
                                                            "id": "somalia",
                                                            "nombre": "Somalia",
                                                            "sinonimos": ["cuerno de áfrica"],
                                                            "latitud": 5.1521,
                                                            "longitud": 46.1996,
                                                            "bandera": "🇸🇴",
                                                            "descripcionGeneral": "País con la costa más larga de África continental, ubicado en el Cuerno de África.",
                                                            "cultura": "Conocida como la 'Nación de Poetas' por su rica tradición oral y literaria.",
                                                            "datosCuriosos": ["Tienen los mejores camellos del mundo (exportan millones).", "Las pinturas rupestres de Laas Geel tienen 5,000 años."],
                                                            "continent": "África",
                                                            "population": 15893219
                                                        },
                                                        {
                                                            "id": "sudan_del_sur",
                                                            "nombre": "Sudán del Sur",
                                                            "sinonimos": ["la nación más joven"],
                                                            "latitud": 6.8770,
                                                            "longitud": 31.3070,
                                                            "bandera": "🇸🇸",
                                                            "descripcionGeneral": "El país más joven del mundo (independiente desde 2011), rico en petróleo y vida silvestre.",
                                                            "cultura": "Hogar de muchos grupos étnicos nilóticos y animistas.",
                                                            "datosCuriosos": ["Es el país más nuevo reconocido por la ONU.", "Alberga una de las mayores migraciones de antílopes del mundo."],
                                                            "continent": "África",
                                                            "population": 11193729
                                                        },
                                                        {
                                                            "id": "chad",
                                                            "nombre": "Chad",
                                                            "sinonimos": ["el corazón muerto de áfrica"],
                                                            "latitud": 15.4542,
                                                            "longitud": 18.7322,
                                                            "bandera": "🇹🇩",
                                                            "descripcionGeneral": "Nación sin litoral que une el norte de África con el África subsahariana.",
                                                            "cultura": "Famoso por el Lago Chad y las montañas Tibesti en el desierto del Sahara.",
                                                            "datosCuriosos": ["Su bandera es casi idéntica a la de Rumania.", "El Lago Chad se ha reducido un 90% en los últimos 50 años."],
                                                            "continent": "África",
                                                            "population": 16425859
                                                        },
                                                        {
                                                            "id": "niger",
                                                            "nombre": "Níger",
                                                            "sinonimos": ["la sartén del mundo"],
                                                            "latitud": 17.6078,
                                                            "longitud": 8.0817,
                                                            "bandera": "🇳🇪",
                                                            "descripcionGeneral": "País de África Occidental nombrado por el río Níger, cubierto mayormente por el Sahara.",
                                                            "cultura": "Hogar del festival Wodaabe donde los hombres se maquillan para impresionar a las mujeres.",
                                                            "datosCuriosos": ["Tiene la tasa de natalidad más alta del mundo.", "Alberga el cementerio de dinosaurios más rico de África."],
                                                            "continent": "África",
                                                            "population": 24206636
                                                        },
                                                        {
                                                            "id": "zambia",
                                                            "nombre": "Zambia",
                                                            "sinonimos": ["tierra del cobre"],
                                                            "latitud": -13.1339,
                                                            "longitud": 27.8493,
                                                            "bandera": "🇿🇲",
                                                            "descripcionGeneral": "País sin salida al mar en el sur de África, famoso por sus safaris a pie.",
                                                            "cultura": "Comparte las Cataratas Victoria con Zimbabue. Muy pacífico y estable.",
                                                            "datosCuriosos": ["El río Zambeze es famoso por el rafting extremo.", "Tienen un festival tradicional llamado Kuomboka (salir del agua)."],
                                                            "continent": "África",
                                                            "population": 18383956
                                                        },
                                                        {
                                                            "id": "malawi",
                                                            "nombre": "Malaui",
                                                            "sinonimos": ["el corazón cálido de áfrica"],
                                                            "latitud": -13.2543,
                                                            "longitud": 34.3015,
                                                            "bandera": "🇲🇼",
                                                            "descripcionGeneral": "Pequeño país definido por el enorme Lago Malaui, que ocupa un tercio de su territorio.",
                                                            "cultura": "Conocidos por ser una de las personas más amigables y hospitalarias de África.",
                                                            "datosCuriosos": ["El Lago Malaui tiene más especies de peces que cualquier otro lago en la Tierra.", "Carlsberg tiene su única fábrica fuera de Dinamarca aquí."],
                                                            "continent": "África",
                                                            "population": 19129955
                                                        },
                                                        {
                                                            "id": "eritrea",
                                                            "nombre": "Eritrea",
                                                            "sinonimos": ["mar rojo"],
                                                            "latitud": 15.1794,
                                                            "longitud": 39.7823,
                                                            "bandera": "🇪🇷",
                                                            "descripcionGeneral": "Nación costera en el Cuerno de África, conocida por su arquitectura colonial italiana.",
                                                            "cultura": "La capital, Asmara, es Patrimonio de la Humanidad por su estilo art déco futurista.",
                                                            "datosCuriosos": ["Es uno de los países más difíciles de visitar (visas estrictas).", "Nunca ha tenido elecciones nacionales desde su independencia."],
                                                            "continent": "África",
                                                            "population": 3546000
                                                        },
                                                        {
                                                            "id": "djibouti",
                                                            "nombre": "Yibuti",
                                                            "sinonimos": ["djibouti"],
                                                            "latitud": 11.8251,
                                                            "longitud": 42.5903,
                                                            "bandera": "🇩🇯",
                                                            "descripcionGeneral": "Pequeño país estratégico en la entrada del Mar Rojo, con paisajes lunares.",
                                                            "cultura": "Punto de encuentro de culturas africanas y árabes.",
                                                            "datosCuriosos": ["El Lago Assal es el punto más bajo de África y es más salado que el Mar Muerto.", "Alberga bases militares de múltiples potencias mundiales."],
                                                            "continent": "África",
                                                            "population": 988002
                                                        },
                                                        {
                                                            "id": "burkina_faso",
                                                            "nombre": "Burkina Faso",
                                                            "sinonimos": ["tierra de los hombres íntegros"],
                                                            "latitud": 12.2383,
                                                            "longitud": -1.5616,
                                                            "bandera": "🇧🇫",
                                                            "descripcionGeneral": "País sin litoral en África Occidental, conocido por su arte y cine.",
                                                            "cultura": "Su nombre significa 'Tierra de la gente honesta'. Alberga el festival de cine más grande de África (FESPACO).",
                                                            "datosCuriosos": ["Su capital es Uagadugú (Ouagadougou).", "Tienen cocodrilos sagrados que son dóciles y la gente los toca."],
                                                            "continent": "África",
                                                            "population": 20903278
                                                        },
                                                        {
                                                            "id": "benin",
                                                            "nombre": "Benín",
                                                            "sinonimos": ["dahomey"],
                                                            "latitud": 9.3077,
                                                            "longitud": 2.3158,
                                                            "bandera": "🇧🇯",
                                                            "descripcionGeneral": "Delgada franja de tierra en África Occidental, cuna de la religión Vudú.",
                                                            "cultura": "Hogar del antiguo Reino de Dahomey y sus guerreras Amazonas (que inspiraron Black Panther).",
                                                            "datosCuriosos": ["El Vudú es una religión oficial y se practica abiertamente.", "Ganvié es conocida como la 'Venecia de África' (ciudad sobre pilotes)."],
                                                            "continent": "África",
                                                            "population": 12123198
                                                        },
                                                        {
                                                            "id": "togo",
                                                            "nombre": "Togo",
                                                            "sinonimos": ["república togolesa"],
                                                            "latitud": 8.6195,
                                                            "longitud": 0.8248,
                                                            "bandera": "🇹🇬",
                                                            "descripcionGeneral": "Una de las naciones más estrechas del mundo, conocida por sus playas y colinas.",
                                                            "cultura": "Famoso por sus mercados de fetiches (amuletos) y tejidos coloridos.",
                                                            "datosCuriosos": ["Lomé, la capital, es una de las pocas capitales ubicadas en una frontera.", "Su costa mide solo 56 km de largo."],
                                                            "continent": "África",
                                                            "population": 8278737
                                                        },
                                                        {
                                                            "id": "sierra_leona",
                                                            "nombre": "Sierra Leona",
                                                            "sinonimos": ["montaña de leones"],
                                                            "latitud": 8.4606,
                                                            "longitud": -11.7799,
                                                            "bandera": "🇸🇱",
                                                            "descripcionGeneral": "País costero conocido por sus diamantes y hermosas playas tropicales.",
                                                            "cultura": "Hogar de chimpancés rescatados y una historia ligada al retorno de esclavos liberados.",
                                                            "datosCuriosos": ["El árbol de algodón gigante en Freetown es el símbolo nacional.", "Freetown tiene uno de los puertos naturales más grandes del mundo."],
                                                            "continent": "África",
                                                            "population": 7976985
                                                        },
                                                        {
                                                            "id": "liberia",
                                                            "nombre": "Liberia",
                                                            "sinonimos": ["tierra de la libertad"],
                                                            "latitud": 6.4281,
                                                            "longitud": -9.4295,
                                                            "bandera": "🇱🇷",
                                                            "descripcionGeneral": "La república más antigua de África, fundada por esclavos liberados de EE.UU.",
                                                            "cultura": "Su bandera se parece a la de EE.UU. y su capital se llama Monrovia (por el presidente Monroe).",
                                                            "datosCuriosos": ["Es uno de los tres países que no usa el sistema métrico oficialmente (junto con EE.UU. y Myanmar).", "Tienen playas famosas para el surf."],
                                                            "continent": "África",
                                                            "population": 5057677
                                                        },
                                                        {
                                                            "id": "guinea",
                                                            "nombre": "Guinea",
                                                            "sinonimos": ["guinea-conakry"],
                                                            "latitud": 9.9456,
                                                            "longitud": -9.6966,
                                                            "bandera": "🇬🇳",
                                                            "descripcionGeneral": "País rico en minerales y conocido como la 'torre de agua' de África Occidental.",
                                                            "cultura": "Cuna del instrumento musical Djembe (tambor) y grandes músicos.",
                                                            "datosCuriosos": ["Posee las mayores reservas de bauxita (aluminio) del mundo.", "Los ríos Níger, Senegal y Gambia nacen aquí."],
                                                            "continent": "África",
                                                            "population": 13132792
                                                        },
                                                        {
                                                            "id": "guinea_bissau",
                                                            "nombre": "Guinea-Bisáu",
                                                            "sinonimos": ["guiné-bissau"],
                                                            "latitud": 11.8037,
                                                            "longitud": -15.1804,
                                                            "bandera": "🇬🇼",
                                                            "descripcionGeneral": "Pequeña nación tropical con un archipiélago protegido (Bijagós).",
                                                            "cultura": "Famosos por su carnaval y su sociedad matriarcal en las islas.",
                                                            "datosCuriosos": ["El archipiélago de Bijagós es reserva de la biosfera con hipopótamos de agua salada.", "No tiene cines operativos."],
                                                            "continent": "África",
                                                            "population": 1967998
                                                        },
                                                        {
                                                            "id": "gambia",
                                                            "nombre": "Gambia",
                                                            "sinonimos": ["la costa sonriente"],
                                                            "latitud": 13.4432,
                                                            "longitud": -15.3101,
                                                            "bandera": "🇬🇲",
                                                            "descripcionGeneral": "El país más pequeño de África continental, rodeado casi totalmente por Senegal.",
                                                            "cultura": "Conocido por su observación de aves y el río Gambia que lo define.",
                                                            "datosCuriosos": ["Tiene una forma extraña y alargada que sigue el curso del río.", "Se vota usando canicas que se tiran en bidones."],
                                                            "continent": "África",
                                                            "population": 2416664
                                                        },
                                                        {
                                                            "id": "mauritania",
                                                            "nombre": "Mauritania",
                                                            "sinonimos": ["tierra de los moros"],
                                                            "latitud": 21.0079,
                                                            "longitud": -10.9408,
                                                            "bandera": "🇲🇷",
                                                            "descripcionGeneral": "Vasto país desértico que une el Magreb con el África subsahariana.",
                                                            "cultura": "Famosos por su té, las bibliotecas del desierto y el tren de mineral de hierro más largo del mundo.",
                                                            "datosCuriosos": ["El Ojo del Sahara (Estructura de Richat) es visible desde el espacio.", "Fue el último país en abolir legalmente la esclavitud (en 1981)."],
                                                            "continent": "África",
                                                            "population": 4649660
                                                        },
                                                        {
                                                            "id": "republica_del_congo",
                                                            "nombre": "República del Congo",
                                                            "sinonimos": ["congo-brazzaville"],
                                                            "latitud": -0.2280,
                                                            "longitud": 15.8277,
                                                            "bandera": "🇨🇬",
                                                            "descripcionGeneral": "País ecuatorial cubierto de selvas tropicales, vecino más pequeño de la R.D. del Congo.",
                                                            "cultura": "Hogar de los 'Sapeurs', hombres que visten trajes de diseñador elegantes en medio de la pobreza.",
                                                            "datosCuriosos": ["Brazzaville y Kinshasa son las capitales más cercanas del mundo (separadas solo por un río).", "El 80% del país es selva virgen."],
                                                            "continent": "África",
                                                            "population": 5518092
                                                        },
                                                        {
                                                            "id": "gabon",
                                                            "nombre": "Gabón",
                                                            "sinonimos": ["el último edén"],
                                                            "latitud": -0.8037,
                                                            "longitud": 11.6094,
                                                            "bandera": "🇬🇦",
                                                            "descripcionGeneral": "Nación costera rica en petróleo y conservación, con playas donde los elefantes caminan.",
                                                            "cultura": "Conocido por sus máscaras tradicionales y rituales Bwiti.",
                                                            "datosCuriosos": ["Más del 10% del país es parque nacional.", "Aquí están los únicos 'hipopótamos surfistas' del mundo (nadan en el mar)."],
                                                            "continent": "África",
                                                            "population": 2225728
                                                        },
                                                        {
                                                            "id": "guinea_ecuatorial",
                                                            "nombre": "Guinea Ecuatorial",
                                                            "sinonimos": ["guinea española"],
                                                            "latitud": 1.6508,
                                                            "longitud": 10.2679,
                                                            "bandera": "🇬🇶",
                                                            "descripcionGeneral": "Único país africano donde el español es idioma oficial, rico en petróleo.",
                                                            "cultura": "Mezcla de tradiciones africanas y herencia colonial española.",
                                                            "datosCuriosos": ["Su capital actual está en una isla, pero están construyendo una nueva en la selva.", "Es el país más rico per cápita de África (aunque muy desigual)."],
                                                            "continent": "África",
                                                            "population": 1402985
                                                        },
                                                        {
                                                            "id": "republica_centroafricana",
                                                            "nombre": "Rep. Centroafricana",
                                                            "sinonimos": ["rca"],
                                                            "latitud": 6.6111,
                                                            "longitud": 20.9394,
                                                            "bandera": "🇨🇫",
                                                            "descripcionGeneral": "País sin litoral en el corazón del continente, rico en diamantes y vida silvestre.",
                                                            "cultura": "Hogar de los pigmeos Ba'Aka, conocidos por su canto polifónico.",
                                                            "datosCuriosos": ["Es uno de los mejores lugares para ver elefantes de bosque.", "Observar las estrellas aquí es increíble por la nula contaminación lumínica."],
                                                            "continent": "África",
                                                            "population": 4829764
                                                        },
                                                        {
                                                            "id": "sao_tome",
                                                            "nombre": "Santo Tomé y Príncipe",
                                                            "sinonimos": ["islas del chocolate"],
                                                            "latitud": 0.1864,
                                                            "longitud": 6.6131,
                                                            "bandera": "🇸🇹",
                                                            "descripcionGeneral": "Pequeña nación insular volcánica en el Golfo de Guinea, cerca del ecuador.",
                                                            "cultura": "Famosos por producir uno de los mejores cacaos del mundo y el café.",
                                                            "datosCuriosos": ["Es el segundo país más pequeño de África.", "Fue uno de los primeros lugares donde se probó la Teoría de la Relatividad de Einstein (eclipse de 1919)."],
                                                            "continent": "África",
                                                            "population": 219161
                                                        },
                                                        {
                                                            "id": "burundi",
                                                            "nombre": "Burundi",
                                                            "sinonimos": ["corazón de áfrica"],
                                                            "latitud": -3.3731,
                                                            "longitud": 29.9189,
                                                            "bandera": "🇧🇮",
                                                            "descripcionGeneral": "Pequeña nación montañosa en la región de los Grandes Lagos.",
                                                            "cultura": "Famosos por sus tambores reales (Patrimonio de la Humanidad).",
                                                            "datosCuriosos": ["Gustave, un cocodrilo gigante devorador de hombres, vive en el lago Tanganica.", "No tienen salida al mar, pero sí muchas playas de lago."],
                                                            "continent": "África",
                                                            "population": 11890781
                                                        },
                                                        {
                                                            "id": "comoras",
                                                            "nombre": "Comoras",
                                                            "sinonimos": ["islas de la luna"],
                                                            "latitud": -11.6455,
                                                            "longitud": 43.3333,
                                                            "bandera": "🇰🇲",
                                                            "descripcionGeneral": "Archipiélago volcánico en el Océano Índico, entre Madagascar y Mozambique.",
                                                            "cultura": "Mayor productor mundial de esencia de Ylang-ylang (usada en perfumes como Chanel No. 5).",
                                                            "datosCuriosos": ["Es el único país árabe que está completamente en el hemisferio sur.", "Tienen un volcán activo, el Monte Karthala."],
                                                            "continent": "África",
                                                            "population": 869595
                                                        },
                                                        {
                                                            "id": "lesoto",
                                                            "nombre": "Lesoto",
                                                            "sinonimos": ["reino en el cielo"],
                                                            "latitud": -29.6099,
                                                            "longitud": 28.2336,
                                                            "bandera": "🇱🇸",
                                                            "descripcionGeneral": "Reino montañoso completamente rodeado por Sudáfrica.",
                                                            "cultura": "Famosos por sus sombreros cónicos de paja (Mokorotlo) y mantas de lana.",
                                                            "datosCuriosos": ["Es el único país del mundo que está enteramente por encima de los 1,000 metros de altura.", "Tienen una estación de esquí en África."],
                                                            "continent": "África",
                                                            "population": 2142252
                                                        },
                                                        {
                                                            "id": "esuatini",
                                                            "nombre": "Esuatini",
                                                            "sinonimos": ["swazilandia"],
                                                            "latitud": -26.5225,
                                                            "longitud": 31.4659,
                                                            "bandera": "🇸🇿",
                                                            "descripcionGeneral": "Pequeña monarquía absoluta sin litoral en el sur de África.",
                                                            "cultura": "Famosos por la danza de las cañas (Umhlanga) donde miles de mujeres bailan para el rey.",
                                                            "datosCuriosos": ["Cambiaron su nombre de Swazilandia a Esuatini en 2018.", "Tienen una gran población de rinocerontes."],
                                                            "continent": "África",
                                                            "population": 1160164
                                                        },
                                                        {
                                                                "id": "antartida",
                                                                "nombre": "Antártida",
                                                                "sinonimos": ["polo sur", "continente blanco", "tierra de hielo"],
                                                                "latitud": -90.0000,
                                                                "longitud": 0.0000,
                                                                "bandera": "🇦🇶",
                                                                "descripcionGeneral": "El continente más austral de la Tierra, cubierto casi en su totalidad por una inmensa capa de hielo.",
                                                                "cultura": "No tiene población nativa ni gobierno. Es un territorio internacional dedicado exclusivamente a la ciencia y la paz.",
                                                                "datosCuriosos": ["Almacena el 70% del agua dulce del planeta en forma de hielo.", "Es el desierto más grande del mundo (sí, es un desierto helado)."],
                                                                "continent": "Antártida",
                                                                "population": 0
                                                            }
    

]
